Repository: FPGAwars/iceWires
Catalog: locale/*/*.po
Languages: es_es

source: Bus28-Split-4-8-8-8: Split the 28-bits bus into four buses of 4, 8, 8, and 8 wires
es_es: Bus28-Split-4-8-8-8: Separar un bus de 28 bits en cuatro buses de 4,8,8 y 8 bits

source: Bus31-Split-7-8-8-8: Split the 31-bits bus into four buses of 7,8, 8 and 8 bits
es_es: Bus31-Split-7-8-8-8: Separar un bus de 31 bits en cuatro buses de 7,8,8 y 8 bits

source: Bus32-Split-17-15: Split the 32-bits bus into two buses of 17 and 15 wires
es_es: Bus32-Split-17-15: Separar un bus de 32 bits en dos buses de 17 y 15 cables

source: Bus32-Split-22-10: Split the 32-bits bus into two buses of 22 and 10 wires
es_es: Bus32-Split-22-10: Separar un bus de 32 bits en dos buses de 22 y 10 cables

source: Bus32-Split-8-24: Split the 28-bits bus into two buses of 8 and 24 wires
es_es: Bus32-Split-8-24: Separar un bus de 28 bits en dos buses de 8 y 24 bits

source: Bus32-Split-29-3: Split the 29-bits bus into two buses of 29 and 3 wires
es_es: Bus32-Split-29-3: Separar un bus de 29 bits en dos buses de 29 y 3 cables

source: Bus32-Split-half: Split the 32-bits bus into two buses of 16 wires
es_es: Bus32-Split-half: Separar un bus de 32 bits en dos buses de 16 bits

source: Bus64-Split-half: Split the 64-bits bus into two buses of 32 wires
es_es: Bus64-Split-half: Separar un bus de 64 bits en dos buses de 32 cables

source: UINT2-1bit-verilog: Extend a 1-bit unsigned integer to 2-bits. Verilog implementation
es_es: UINT2-1bit-veriog: Extender un entero sin signo de 1 bit a 2 bits. Implementación en Verilog

source: UINT2-1bit: Extend a 1-bit unsigned integer to 2-bits
es_es: UINT2-1bit: Extender un entero sin signo de 1 bit a 2 bits

source: UINT8-1bit: Extend a 1-bit unsigned integer to 8-bits
es_es: UINT8-1bit: Extender un entero sin signo de 1 bit a 8 bits

source: 7bits constant value: 0
es_es: Valor constante 0 de 7 bits

source: Generic: 7-bits generic constant (0-127)
es_es: Generic: Constante genérica de 7-bits (0-127)

source: UINT8-2bits: Extend a 2-bits unsigned integer to 8-bits
es_es: UINT8-2bit: Extender un entero sin signo de 2 bits a 8 bits

source: 6bits constant value: 0
es_es: Valor constante 0 de 6 bits

source: Generic: 6-bits generic constant (0-63)
es_es: Generic: Constante genérica de 6-bits (0-63)

source: UINT8-3bits: Extend a 3-bits unsigned integer to 8-bits
es_es: UINT8-3bit: Extender un entero sin signo de 3 bits a 8 bits

source: 5bits constant value: 0
es_es: Valor constante 0 de 5 bits

source: Generic: 5-bits generic constant (0-31)
es_es: Generic: Constante genérica de 5-bits (0-31)

source: UINT8-4bits: Extend a 4-bits unsigned integer to 8-bits
es_es: UINT8-4bit: Extender un entero sin signo de 4 bits a 8 bits

source: 4bits constant value: 0
es_es: Valor constante 0 de 4 bits

source: Generic: 4-bits generic constant (0-15)
es_es: Generic: Constante genérica de 4-bits (0-15)

source: UINT8-5bits: Extend a 5-bits unsigned integer to 8-bits
es_es: UINT8-5bit: Extender un entero sin signo de 5 bits a 8 bits

source: 3bits constant value: 0
es_es: Valor constante 0 de 3 bits

source: Generic: 3-bits generic constant (0-7)
es_es: Generic: Constante genérica de 3-bits (0-7)

source: UINT8-6bits: Extend a 6-bits unsigned integer to 8-bits
es_es: UINT8-6bit: Extender un entero sin signo de 6 bits a 8 bits

source: 2bits constant value: 0
es_es: Valor constante 0 de 2 bits

source: Generic: 2-bits generic constant (0,1,2,3)
es_es: Generic: Constante genérica de 2-bits (0,1,2,3)

source: UINT8-7bits: Extend a 7-bits unsigned integer to 8-bits
es_es: UINT8-2bit: Extender un entero sin signo de 7 bits a 8 bits

source: UINT12-8bit-verilog: Extend a 8-bit unsigned integer to 12-bits. Verilog implementation
es_es: UINT12-8bit-verilog: Extender un entero sin signo de 8 bits a 12 bits. Implementación en Verilog

source: UINT12-8bits: Extend a 8-bits unsigned integer to 12-bits
es_es: UINT12-8bit: Extender un entero sin signo de 8 bit a 12 bits

source: UINT32-10bit-verilog: Extend a 10-bit unsigned integer to 32-bits. Verilog implementation
es_es: UINT32-10bit-verilog: Extender un entero sin signo de 10 bits a 32 bits. Implementación en Verilog

source: UINT32-11bit-verilog: Extend a 11-bit unsigned integer to 32-bits. Verilog implementation
es_es: UINT32-11bit-verilog: Extender un entero sin signo de 11 bits a 32 bits. Implementación en Verilog

source: UINT32-12bit-verilog: Extend a 12-bit unsigned integer to 32-bits. Verilog implementation
es_es: UINT32-12bit-verilog: Extender un entero sin signo de 12 bits a 32 bits. Implementación en Verilog

source: UINT32-13bit-verilog: Extend a 13-bit unsigned integer to 32-bits. Verilog implementation
es_es: UINT32-13bit-verilog: Extender un entero sin signo de 13 bits a 32 bits. Implementación en Verilog

source: UINT32-14bit-verilog: Extend a 14-bit unsigned integer to 32-bits. Verilog implementation
es_es: UINT32-14bit-verilog: Extender un entero sin signo de 14 bits a 32 bits. Implementación en Verilog

source: UINT16-15bit-verilog: Extend a 15-bit unsigned integer to 32-bits. Verilog implementation
es_es: UINT32-15bit-verilog: Extender un entero sin signo de 15 bits a 32 bits. Implementación en Verilog

source: UINT32-8bit-verilog: Extend a 8-bit unsigned integer to 32-bits. Verilog implementation
es_es: UINT32-8bit-verilog: Extender un entero sin signo de 8 bits a 32 bits. Implementación en Verilog

source: UINT32-9bit-verilog: Extend a 9-bit unsigned integer to 32-bits. Verilog implementation
es_es: UINT32-9bit-verilog: Extender un entero sin signo de 9 bits a 32 bits. Implementación en Verilog

source: UINT16-9bits: Extend a 9-bits unsigned integer to 16-bits
es_es: UINT8-6bit: Extender un entero sin signo de 9 bits a 16 bits

source: 8bits constant value: 0
es_es: Valor constante 0 de 8 bits

source: Generic: 8-bits generic constant (0-255)
es_es: Generic: Constante genérica de 8-bits (0-255)

source: UINT16-10bits: Extend a 10-bits unsigned integer to 16-bits
es_es: UINT16-10bit: Extender un entero sin signo de 10 bits a 16 bits

source: UINT16-11bits: Extend a 11-bits unsigned integer to 16-bits
es_es: UINT16-11bit: Extender un entero sin signo de 11 bits a 16 bits

source: UINT16-12bits: Extend a 12-bits unsigned integer to 16-bits
es_es: UINT16-12bit: Extender un entero sin signo de 12 bits a 16 bits

source: UINT16-13bits: Extend a 13-bits unsigned integer to 16-bits
es_es: UINT16-13bit: Extender un entero sin signo de 13 bits a 16 bits

source: UINT16-14bits: Extend a 14-bits unsigned integer to 16-bits
es_es: UINT16-14bit: Extender un entero sin signo de 14 bits a 16 bits

source: UINT16-15bits: Extend a 12-bits unsigned integer to 16-bits
es_es: UINT16-15bit: Extender un entero sin signo de 12 bits a 16 bits

source: UINT32-16bit-verilog: Extend a 16-bit unsigned integer to 32-bits. Verilog implementation
es_es: UINT32-16bit-veriog: Extender un entero sin signo de 16 bit a 32 bits. Implementación en Verilog

source: Uint32-17-bits
es_es: Uint32-17-bit

source: UINT32-17bit-verilog: Extend a 17-bit unsigned integer to 32-bits. Verilog implementation
es_es: UINT32-17bit-veriog: Extender un entero sin signo de 17 bit a 32 bits. Implementación en Verilog

source: Uint32-18-bits
es_es: Uint32-18-bit

source: UINT32-18bit-verilog: Extend a 18-bit unsigned integer to 32-bits. Verilog implementation
es_es: UINT32-18bit-veriog: Extender un entero sin signo de 18 bit a 32 bits. Implementación en Verilog

source: UINT32-19bit-verilog: Extend a 19-bit unsigned integer to 32-bits. Verilog implementation
es_es: UINT32-19bit-veriog: Extender un entero sin signo de 19 bit a 32 bits. Implementación en Verilog

source: Uint32-2-bits
es_es: Uint32-2-bit

source: UINT32-2bit-verilog: Extend a 2-bit unsigned integer to 32-bits. Verilog implementation
es_es: UINT32-2bit-veriog: Extender un entero sin signo de 2 bit a 32 bits. Implementación en Verilog

source: Uint32-20-bits
es_es: Uint32-20-bit

source: UINT32-20bit-verilog: Extend a 20-bit unsigned integer to 32-bits. Verilog implementation
es_es: UINT32-20bit-veriog: Extender un entero sin signo de 20 bit a 32 bits. Implementación en Verilog

source: UINT32-21bit-verilog: Extend a 21-bit unsigned integer to 32-bits. Verilog implementation
es_es: UINT32-21bit-veriog: Extender un entero sin signo de 21 bit a 32 bits. Implementación en Verilog

source: UINT32-22bit-verilog: Extend a 22-bit unsigned integer to 32-bits. Verilog implementation
es_es: UINT32-22bit-veriog: Extender un entero sin signo de 22 bits a 32 bits. Implementación en Verilog

source: UINT32-23bit-verilog: Extend a 23-bit unsigned integer to 32-bits. Verilog implementation
es_es: UINT32-23bit-veriog: Extender un entero sin signo de 23 bit a 32 bits. Implementación en Verilog

source: UINT32-24bit-verilog: Extend a 24-bit unsigned integer to 32-bits. Verilog implementation
es_es: UINT32-24bit-verilog: Extender un entero sin signo de 24 bits a 32 bits. Implementación en Verilog

source: UINT32-25bit-verilog: Extend a 25-bit unsigned integer to 32-bits. Verilog implementation
es_es: UINT32-25bit-verilog: Extender un entero sin signo de 25 bits a 32 bits. Implementación en Verilog

source: UINT32-26bit-verilog: Extend a 26-bit unsigned integer to 32-bits. Verilog implementation
es_es: UINT32-26bit-veriog: Extender un entero sin signo de 26 bit a 32 bits. Implementación en Verilog

source: UINT32-27bit-verilog: Extend a 27-bit unsigned integer to 32-bits. Verilog implementation
es_es: UINT32-27bit-verilog: Extender un entero sin signo de 27 bits a 32 bits. Implementación en Verilog

source: Uint32-28-bits
es_es: Uint32-28-bit

source: UINT32-28bit-verilog: Extend a 28-bit unsigned integer to 32-bits. Verilog implementation
es_es: UINT32-28bit-verilog: Extender un entero sin signo de 28 bits a 32 bits. Implementación en Verilog

source: UINT32-29bit-verilog: Extend a 29-bit unsigned integer to 32-bits. Verilog implementation
es_es: UINT32-29bit-verilog: Extender un entero sin signo de 32 bits a 32 bits. Implementación en Verilog

source: UINT32-30bit-verilog: Extend a 30-bit unsigned integer to 32-bits. Verilog implementation
es_es: UINT32-30bit-verilog: Extender un entero sin signo de 30 bits a 32 bits. Implementación en Verilog

source: UINT32-31bit-verilog: Extend a 31-bit unsigned integer to 32-bits. Verilog implementation
es_es: UINT32-31bit-verilog: Extender un entero sin signo de 31 bits a 32 bits. Implementación en Verilog

source: Uint32-8-bits
es_es: Uint32-08-bits

source: UINT32-16bits: Extend a 16-bits unsigned integer to 32-bits
es_es: UINT32-16bits: Extender un entero sin signo de 16 a 32 bits

source: 16bits constant value: 0
es_es: Valor constante de 16 bits: 0

source: UINT32-17bits: Extend a 17-bits unsigned integer to 32-bits
es_es: UINT32-17bits: Extender un entero sin signo de 17 bits a 32-bits

source: 15bits constant value: 0
es_es: Valor constante de 15 bits: 0

source: Generic: 15-bits generic constant
es_es: Generic: Constante genérica de 15-bits

source: UINT32-18bits: Extend a 18-bits unsigned integer to 32-bits
es_es: UINT32-18bits: Extender un entero sin signo de 18 bits a 32-bits

source: 14bits constant value: 0
es_es: Valor constante de 14 bits: 0

source: Generic: 14-bits generic constant
es_es: Generic: Constante genérica de 14-bits

source: UINT32-19bits: Extend a 19-bits unsigned integer to 32-bits
es_es: UINT32-19bits: Extender un entero sin signo de 19 bits a 32-bits

source: 13bits constant value: 0
es_es: Valor constante de 13 bits: 0

source: Generic: 13-bits generic constant
es_es: Generic: Constante genérica de 13-bits

source: UINT32-8bits: Extend a 2-bits unsigned integer to 32-bits
es_es: UINT32-8bits: Extender un entero sin signo de 8 bits a 32-bits

source: Generic: 30-bits generic constant
es_es: Generic: Constante genérica de 30-bits

source: UINT32-20bits: Extend a 20-bits unsigned integer to 32-bits
es_es: UINT32-20bits: Extender un entero sin signo de 20 bits a 32-bits

source: 12bits constant value: 0
es_es: Valor constante de 12 bits: 0

source: Generic: 12-bits generic constant (0-4095)
es_es: Generic: Constante genérica de 12-bits (0-4095)

source: UINT32-21bits: Extend a 21-bits unsigned integer to 32-bits
es_es: UINT32-21bits: Extender un entero sin signo de 21 bits a 32-bits

source: 11bits constant value: 0
es_es: Valor constante de 11 bits: 0

source: Generic: 11-bits generic constant
es_es: Generic: Constante genérica de 11-bits

source: UINT32-22bits: Extend a 22-bits unsigned integer to 32-bits
es_es: UINT32-22bits: Extender un entero sin signo de 22 bits a 32-bits

source: 10bits constant value: 0
es_es: Valor constante de 10 bits: 0

source: Generic: 9-bits generic constant
es_es: Generic: Constante genérica de 9-bits

source: UINT32-23bits: Extend a 23-bits unsigned integer to 32-bits
es_es: UINT32-23bits: Extender un entero sin signo de 23 bits a 32-bits

source: 9bits constant value: 0
es_es: Valor constante de 9 bits: 0

source: UINT32-24bits: Extend a 24-bits unsigned integer to 32-bits
es_es: UINT32-24bits: Extender un entero sin signo de 24 bits a 32-bits

source: UINT32-25bits: Extend a 25-bits unsigned integer to 32-bits
es_es: UINT32-25bits: Extender un entero sin signo de 25 bits a 32-bits

source: UINT32-26bits: Extend a 26-bits unsigned integer to 32-bits
es_es: UINT32-26bits: Extender un entero sin signo de 26 bits a 32-bits

source: UINT32-27bits: Extend a 27-bits unsigned integer to 32-bits
es_es: UINT32-27bits: Extender un entero sin signo de 27 bits a 32-bits

source: UINT32-28bits: Extend a 28-bits unsigned integer to 32-bits
es_es: UINT32-28bits: Extender un entero sin signo de 28 bits a 32-bits

source: UINT32-29bits: Extend a 29-bits unsigned integer to 32-bits
es_es: UINT32-29bits: Extender un entero sin signo de 29 bits a 32-bits

source: UINT32-30bits: Extend a 30-bits unsigned integer to 32-bits
es_es: UINT32-30bits: Extender un entero sin signo de 30 bits a 32-bits

source: UINT32-31bits: Extend a 31-bits unsigned integer to 32-bits
es_es: UINT32-31bits: Extender un entero sin signo de 31 bits a 32-bits

source: UINT32-8bits: Extend a 8-bits unsigned integer to 32-bits
es_es: UINT32-8bits: Extender un entero sin signo de 8 bits a 32-bits

source: UINT4-1bit-verilog: Extend a 1-bit unsigned integer to 4-bits. Verilog implementation
es_es: UINT4-1bit-veriog: Extender un entero sin signo de 1 bit a 4 bits. Implementación en Verilog

source: UINT4-2bit-verilog: Extend a 2-bit unsigned integer to 4-bits. Verilog implementation
es_es: UINT4-2bit-veriog: Extender un entero sin signo de 2 bits a 4 bits. Implementación en Verilog

source: UINT4-3bit-verilog: Extend a 3-bit unsigned integer to 4-bits. Verilog implementation
es_es: UINT4-3bit-veriog: Extender un entero sin signo de 3 bits a 4 bits. Implementación en Verilog

source: UINT4-1bit: Extend a 1-bit unsigned integer to 4-bits
es_es: UINT4-1bit: Extender un entero sin signo de 1 bit a 4 bits

source: UINT4-2bit: Extend a 2-bit unsigned integer to 4-bits
es_es: UINT4-2bit: Extender un entero sin signo de 2 bit a 4 bits

source: UINT4-3bit: Extend a 3-bit unsigned integer to 4-bits
es_es: UINT4-3bit: Extender un entero sin signo de 3 bit a 4 bits

source: Bus2: Two bits plain Bus
es_es: Bus2: Bus simple de 2 bits

source: Bus3: Three bits plain Bus
es_es: Bus3: Bus simple de 3 bits

source: Bus4: Four bits plain Bus
es_es: Bus4: Bus de 4 bits

source: Bus5: Five bits plain Bus
es_es: Bus5: Bus simple de 5 bits

source: Bus6: Six bits plain Bus
es_es: Bus6: Bus simple de 6 bits

source: Bus7: Seven bits plain Bus
es_es: Bus7: Bus simple de 7 bits

source: Bus8: Eight bits plain Bus
es_es: Bus8: Bus simple de 8 bits

source: Wire: Just a simple wire
es_es: Wire: Un simple cable

source: 00-Index
es_es: 00-Indice

source: SL1: Shift a 3-bit value one bit left. LSB is filled with
es_es: SL1: Desplazar un valor de 3 bits un bit a la izquierda. LSB se rellena con

source: SL1: Shift a 4-bit value one bit left. LSB is filled with
es_es: SL1: Desplazar un valor de 4 bits un bit a la izquierda. LSB se rellena con

source: # INDEX: IceWire Collection
es_es: # ÍNDICE: Colección IceWires

source: ## Wires
es_es: ## Cables

source: ## Copy
es_es: ## Copiar

source: ## Reversal
es_es: ## Inversión

source: ## Shift-left
es_es: ## Desplazamiento a la izquierda

source: ## Shift-right
es_es: ## Desplazamiento a la derecha

source: ## Sign
es_es: ## Signo

source: ### NO EXIST
es_es: ### NO EXISTE

source: Auxiliary cables
es_es: Cables auxiliares

source: ## Description
es_es: ## Descripción

source: Build bigger buses by Join smaller buses
es_es: Construir buses mediante la unión de buses más pequeños

source: Get sub-buses or wires from a bigger bus
es_es: Obtener los sub-buses o cables a partir de bus mayor

source: Create a Bus of N bits by copying N times the input
es_es: Crear un Bus de N bits copiando N veces el bit de entrada

source: Get the sign bit of an element of N bits (The sign bit is the MSB)
es_es: Obtener el bit de signo de un elemento de N bits (El bit de signo es el MSB)

source: Shift to the right the input data * Uint data: The sign bit is set to 0 * Int data: The sign bit is kept
es_es: Desplazar a la derecha el dato de entrada * Datos Uint: El signo se pone a 0 * Datos Int: El signo se mantiene

source: Shift to the left the input data * Uint data: The sign bit is set to 0 * Int data: The sign bit is kept
es_es: Desplazar a la izquierda el dato de entrada * Datos Uint: El bit se signo se pone a 0 * Datos Int: El bit de signo se mantiene

source: Reverse the position of the wires in the bus. Ex: The 4-input bus b3,b2,b1,b0 is changed to b0,b1,b2,b3
es_es: Invertir la posición de los cables en el bus. Ej. El bus de entrada de 4 bits b3,b2,b1,b0 se cambia a b0,b1,b2,b3

source: Extend to the input bus to a N-bits bus, by adding 0s as most significant bits. Ex: The 2-bits bus b1,b0 is extended as a 4-bits bus: 0,0,b1,b0
es_es: Extender el bus de entrada a uno de N bits, mediante la adición de 0s como bits de mayor peso. Ej. El bus de 2 bits b1,b0 se extiende como un bus de 4-bits: 0,0,b1,b0

source: 01-Index
es_es: 01-Indice

source: SL1: Shift a 8-bit value one bit left. LSB is filled with
es_es: SL1: Desplazar un valor de 8 bits un bit a la izquierda. LSB se rellena con

source: 02-Index
es_es: 02-Indice

source: Bus27-Split-3-8-8-8: Split the 27-bits bus into four buses of 3,8,8 and 8 wires
es_es: Bus27-Split-3-8-8-8: Separar un bus de 27 bits en cuatro buses de 3,8,8 y 8 bits

source: SL1: Shift a 16-bit value one bit left. LSB is filled with
es_es: SL1: Desplazar un valor de 16 bits un bit a la izquierda. LSB se rellena con

source: SR1: Shift a 16-bit value one bit right. MSB is filled with
es_es: SR1: Desplazar un valor de 16-bits un bit a la derecha. MSB se rellena con

source: SR1-32bits: Shift a 32-bit value one bit right. MSB is filled with the input in
es_es: SR1-32bits: Desplazar un valor de 32-bits un bit a la derecha. MSB se rellena con la entrada in

source: ## Join Menu
es_es: ## Menú Agregar

source: ## Split Menu
es_es: ## Menú Separar

source: # Example: Using the Bus2-Split-all block The buttons SW2 and SW1 are read in a 2-bits bus. This bus is split into its two bits and shown on two independent LEDs
es_es: # Ejemplo: Usando el bloque Bus-Split-all Los botones SW2 y SW1 se leen a través de un bus de 2 bits. Este bus se divide en sus dos bits y se muestran en dos LEDs independientes

source: 2 bits Input BUS
es_es: Entrada de BUS de 2 bits

source: # Example: Using the Split-1-4 block The 5-bits constant is split into its Most Significant bit and the 4 Less Significant bits. Both sub-buses are shown on the LED7 and LEDs 0,1,2 and 3 respectivelly
es_es: # Ejemplo: Usando un bloque Split-1-4 La constante de 5 bits se divide en su bit más significativo y los 4 bits menos significativos. Ambos sub-buses se muestran en los LEDs 7 y LEDs 0,1,2 y 3 respectivamente

source: 5 bits Input BUS
es_es: Bus de entrada de 5 bits

source: 5-bits constant
es_es: Constante de 5 bits

source: # Example: Using the Bus2-Join-all block The state of buttons SW1 and SW2 are inserted into a 2-bits bus and then shown on LEDs 0 and 7
es_es: # Ejemplo: Usando el bloque Bus2-Join-all El estado de los botones SW1 y SW2 se introducen en un bus de 2 bits y luego se muestran en los LEDs 0 y 7

source: 2 bits Output BUS
es_es: Bus de salida de 2 bits

source: # Example: Using the Join-1-4 block A generic 4-bits constant and the SW1 button are joined together into a 5-bits BUS and it is shown on 5 LEDs
es_es: # Ejemplo: Usando el bloque Join-1-4 Una constante de 4 bits y el botón SW1 se juntan en un bus de 5-bits y se muestran en 5 LEDs

source: 4 bits Input BUS
es_es: Bus de entrada de 4 bits

source: 4-bits constant
es_es: Constante de 4 bits

source: # Example: Bus-2: Connection of two buses
es_es: # Ejemplo: Bus-2: Conexión de dos buses

source: 2-bits input bus
es_es: Bus de entrada de 2 bits

source: 2-bits Bus block
es_es: Block de Bus de 2 bits

source: 2-bits output bus
es_es: Bus de salida de 2 bits

source: **NOTE**: This is just an example of use of the Bus-2 block. But the connection between the two buttons and the LEDs can be done directly, without using the 2-Bus block
es_es: **NOTA**: Este es sólo un ejemplo de uso del bloque Bus-2. Pero la conexión entre los dos botones y los LEDs se pueden hacer directamente, sin usar el bloque Bus-2

source: # Example: Turning on 8 LEDs with one button When the button SW1 is pressed, the 8 LEDs are turned on
es_es: # Ejemplo: Encendiendo 8 LEDs con un botón Cuando el botón SW1 se aprieta, se encienden los 8 LEDs

source: Copy-8 Block
es_es: Bloque Copy-8

source: # Example: Displaying the sign bit on a LED The Sign of a number is shown on an LED
es_es: # Ejemplo: Mostrando el bit de signo en un LED El signo de un número se muestra en un LED

source: Sign-int8 Block
es_es: Bloque Sign-int8

source: Configurable buttons (pull-up on/off. Not on/off) with tic output
es_es: Botón configurable (pull-up on/off. Not on/off)

source: # Example: Displaying the two buttons on the LEDs
es_es: # Ejemplo: Mostrando los dos botones en los LEDs

source: ## Bus-4 Shift right example Shift a 4-bits number 1 bit to the right. The result is shown on the LEDs
es_es: # Bus-4 Shift right: Ejemplos Desplazar 1 bit a la derecha un número de 4bits. El resultado se muestra en los LEDs

source: Number to shift 1 bit to the right
es_es: Número a desplazar 1 bit a la derecha

source: Insert 0 as the MSB
es_es: Insertar 0 como el bit de mayor peso

source: Display the shifted number on the LEDs
es_es: Mostrar el número desplazado en los LEDs

source: # Copy-2: Manual testing with one pushbutton and two LEDs When the button is pressed, the Two LEDs are turned on
es_es: # Copy-2: Prueba manual con un botón y dos LEDs Cuando el botón se aprieta se encienden los dos LEDs

source: # Copy-3: Manual testing with one pushbutton and LEDs When the button is pressed, the LEDs are turned on
es_es: # Copy-3: Prueba manual con un botón y LEDs Cuando el botón se aprieta se encienden los dos LEDs

source: # Copy-4: Manual testing with one pushbutton and LEDs When the button is pressed, the LEDs are turned on
es_es: # Copy-4: Prueba manual con un botón y LEDs Cuando el botón se aprieta se encienden los LEDs

source: # Copy-5: Manual testing with one pushbutton and LEDs When the button is pressed, the LEDs are turned on
es_es: # Copy-5: Prueba manual con un botón y LEDs Cuando el botón se aprieta se encienden los LEDs

source: # Copy-6: Manual testing with one pushbutton and LEDs When the button is pressed, the LEDs are turned on
es_es: # Copy-6: Prueba manual con un botón y LEDs Cuando el botón se aprieta se encienden los LEDs

source: # Copy-7: Manual testing with one pushbutton and LEDs When the button is pressed, the LEDs are turned on
es_es: # Copy-7: Prueba manual con un botón y LEDs Cuando el botón se aprieta se encienden los LEDs
