Repository: FPGAwars/iceWires
Catalog: locale/*/*.po
Languages: es_es

source: Copy
es_es: Copiar

source: Join
es_es: Agregar

source: Wires
es_es: Cables

source: Copy-2: Copy the input wire twice and generate a 2 bits Bus output (Verilog implementation)
es_es: Copy-2: Copiar el cable de entrada dos veces y generar una salida de bus de 2 bits (Implementación en Verilog)

source: Copy-3: Copy the input wire twice and generate a 3 bits Bus output (Verilog implementation)
es_es: Copy-3: Copiar el cable de entrada dos veces y generar una salida de bus de 3 bits (Implementación en Verilog)

source: Copy-4: Copy the input wire twice and generate a 4 bits Bus output (Verilog implementation)
es_es: Copy-4: Copiar el cable de entrada dos veces y generar una salida de bus de 4 bits (Implementación en Verilog)

source: Copy-5: Copy the input wire twice and generate a 5 bits Bus output (Verilog implementation)
es_es: Copy-5: Copiar el cable de entrada dos veces y generar una salida de bus de 5 bits (Implementación en Verilog)

source: Copy-6: Copy the input wire twice and generate a 6 bits Bus output (Verilog implementation)
es_es: Copy-6: Copiar el cable de entrada dos veces y generar una salida de bus de 6 bits (Implementación en Verilog)

source: Copy-7: Copy the input wire twice and generate a 7 bits Bus output (Verilog implementation)
es_es: Copy-7: Copiar el cable de entrada dos veces y generar una salida de bus de 7 bits (Implementación en Verilog)

source: Copy-8: Copy the input wire twice and generate a 8 bits Bus output (Verilog implementation)
es_es: Copy-8: Copiar el cable de entrada dos veces y generar una salida de bus de 8 bits (Implementación en Verilog)

source: Copy-9: Copy the input wire twice and generate a 9 bits Bus output (Verilog implementation)
es_es: Copy-9: Copiar el cable de entrada dos veces y generar una salida de bus de 9 bits (Implementación en Verilog)

source: Copy-10: Copy the input wire twice and generate a 10 bits Bus output (Verilog implementation)
es_es: Copy-10: Copiar el cable de entrada dos veces y generar una salida de bus de 10 bits (Implementación en Verilog)

source: Copy-11: Copy the input wire twice and generate a 11 bits Bus output (Verilog implementation)
es_es: Copy-11: Copiar el cable de entrada dos veces y generar una salida de bus de 11 bits (Implementación en Verilog)

source: Copy-12: Copy the input wire twice and generate a 12 bits Bus output (Verilog implementation)
es_es: Copy-12: Copiar el cable de entrada dos veces y generar una salida de bus de 12 bits (Implementación en Verilog)

source: Copy-13: Copy the input wire twice and generate a 13 bits Bus output (Verilog implementation)
es_es: Copy-13: Copiar el cable de entrada dos veces y generar una salida de bus de 2 bits (Implementación en Verilog)

source: Copy-14: Copy the input wire twice and generate a 14 bits Bus output (Verilog implementation)
es_es: Copy-14: Copiar el cable de entrada dos veces y generar una salida de bus de 2 bits (Implementación en Verilog)

source: not-x16: 16-bits not gate
es_es: not-x16: Puerta NOT de 16 bits

source: Input
es_es: Entrada

source: Output
es_es: Salida

source: Copy-16: Copy the input wire twice and generate a 16 bits Bus output (Verilog implementation)
es_es: Copy-16: Copiar el cable de entrada dos veces y generar una salida de bus de 16 bits (Implementación en Verilog)

source: Copy-17: Copy the input wire twice and generate a 17 bits Bus output (Verilog implementation)
es_es: Copy-17: Copiar el cable de entrada dos veces y generar una salida de bus de 17 bits (Implementación en Verilog)

source: Copy-18: Copy the input wire twice and generate a 18 bits Bus output (Verilog implementation)
es_es: Copy-18: Copiar el cable de entrada dos veces y generar una salida de bus de 18 bits (Implementación en Verilog)

source: Copy-19: Copy the input wire twice and generate a 19 bits Bus output (Verilog implementation)
es_es: Copy-19: Copiar el cable de entrada dos veces y generar una salida de bus de 19 bits (Implementación en Verilog)

source: Copy-20: Copy the input wire twice and generate a 20 bits Bus output (Verilog implementation)
es_es: Copy-20: Copiar el cable de entrada dos veces y generar una salida de bus de 20 bits (Implementación en Verilog)

source: Copy-21: Copy the input wire twice and generate a 21 bits Bus output (Verilog implementation)
es_es: Copy-21: Copiar el cable de entrada dos veces y generar una salida de bus de 21 bits (Implementación en Verilog)

source: Copy-22: Copy the input wire twice and generate a 22 bits Bus output (Verilog implementation)
es_es: Copy-22: Copiar el cable de entrada dos veces y generar una salida de bus de 22 bits (Implementación en Verilog)

source: Copy-23: Copy the input wire twice and generate a 23 bits Bus output (Verilog implementation)
es_es: Copy-23: Copiar el cable de entrada dos veces y generar una salida de bus de 23 bits (Implementación en Verilog)

source: Copy-24: Copy the input wire twice and generate a 24 bits Bus output (Verilog implementation)
es_es: Copy-24: Copiar el cable de entrada dos veces y generar una salida de bus de 24 bits (Implementación en Verilog)

source: Copy-25: Copy the input wire twice and generate a 25 bits Bus output (Verilog implementation)
es_es: Copy-25: Copiar el cable de entrada dos veces y generar una salida de bus de 25 bits (Implementación en Verilog)

source: Copy-26: Copy the input wire twice and generate a 26 bits Bus output (Verilog implementation)
es_es: Copy-26: Copiar el cable de entrada dos veces y generar una salida de bus de 26 bits (Implementación en Verilog)

source: Copy-27: Copy the input wire twice and generate a 27 bits Bus output (Verilog implementation)
es_es: Copy-27: Copiar el cable de entrada dos veces y generar una salida de bus de 27 bits (Implementación en Verilog)

source: Copy-28: Copy the input wire twice and generate a 28 bits Bus output (Verilog implementation)
es_es: Copy-28: Copiar el cable de entrada dos veces y generar una salida de bus de 28 bits (Implementación en Verilog)

source: Copy-30: Copy the input wire twice and generate a 30 bits Bus output (Verilog implementation)
es_es: Copy-30: Copiar el cable de entrada dos veces y generar una salida de bus de 30 bits (Implementación en Verilog)

source: Copy-31: Copy the input wire twice and generate a 31 bits Bus output (Verilog implementation)
es_es: Copy-31: Copiar el cable de entrada dos veces y generar una salida de bus de 31 bits (Implementación en Verilog)

source: Copy-32: Copy the input wire twice and generate a 32 bits Bus output (Verilog implementation)
es_es: Copy-32: Copiar el cable de entrada dos veces y generar una salida de bus de 32 bits (Implementación en Verilog)

source: Copy-2: Copy the input wire twice and generate a 2 bits Bus output
es_es: Copy-2: Copiar el cable de entrada dos veces y generar una salida de bus de 2 bits

source: Bus2-Join-all: Joint two wires into a 2-bits Bus
es_es: Bus-2-join-all: Agregar dos cables a un bus de 2 bits

source: Copy-3: Copy the input wire and creates a 3 bits Bus output
es_es: Copy-3: Copiar el cable de entrada y sacarlo por un bus de 3 bits

source: Bus3-Join-all: Joint three wires into a 3-bits Bus
es_es: Bus-3-join-all: Agregar tres cables a un bus de 3 bits

source: Copy-4: Copy the input wire and creates a 4 bits Bus output
es_es: Copy-4: Copiar el cable de entrada y sacarlo por un bus de 4 bits

source: Bus4-Join-all: Join all the wires into a 4-bits Bus
es_es: Bus-4-join-all: Agregar todos los cables a un bus de 4 bits

source: Copy-5: Copy the input wire and creates a 5 bits Bus output
es_es: Copy-5: Copiar el cable de entrada y sacarlo por un bus de 5 bits

source: Bus5-Join-all: Join all the wires into a 5-bits Bus
es_es: Bus5-join-all: Unir todos los cables en un bus de 5 bits

source: Copy-6: Copy the input wire and creates a 6 bits Bus output
es_es: Copy-6: Copiar el cable de entrada y sacarlo por un bus de 6 bits

source: Bus6-Join-all: Join all the wires into a 6-bits Bus
es_es: Bus6-join-all: Unir todos los cables en un bus de 6 bits

source: Copy-7: Copy the input wire and creates a 7 bits Bus output
es_es: Copy-7: Copiar el cable de entrada y sacarlo por un bus de 7 bits

source: Bus7-Join-all: Join all the wires into a 7-bits Bus
es_es: Bus7-join-all: Unir todos los cables en un bus de 7-bits

source: Copy-8: Copy the input wire and creates a 8 bits Bus output
es_es: Copy-8: Copiar el cable de entrada y sacarlo por un bus de 8 bits

source: Bus8-Join-all: Join all the wires into a 8-bits Bus
es_es: Bus8-join-all: Unir dos buses en un bus de 8 bits

source: Copy-9: Copy the input wire and creates a 9 bits Bus output
es_es: Copy-9: Copiar el cable de entrada y sacarlo por un bus de 9 bits

source: Bus8-Join-1-8: Join the two buses into an 9-bits Bus
es_es: Bus8-join-1-8: Unir dos buses en un bus de 9 bits

source: Copy-12: Copy the input wire and creates a 12 bits Bus output
es_es: Copy-12: Copiar el cable de entrada y sacarlo por un bus de 12 bits

source: Bus12-Join-4-8: Join the two buses into an 12-bits Bus
es_es: Bus12-join-4-8: Unir dos buses en un bus de 12 bits

source: Bus3-Join-1-2: Join two buses of 2 and 1 bits into a 3-bits Bus
es_es: Bus3-join-1-2: Unir dos buses de 2 y 1 bits en un bus de 3 bits

source: Bus3-Join-2-1: Joint two buses of 1 and 2 bits into a 3-bits Bus
es_es: Bus3-join-2-1: Unir dos buses de 1 y 2 bits en un bus de 3 bits

source: Bus4-Join-1-3: Join the two buses into a 4-bits Bus
es_es: Bus-4-join-1-3: Unir todos los cables en un bus de 4 bits

source: Bus4-Join-3-1: Join the two buses into a 4-bits Bus
es_es: Bus4-join-3-1: Unir dos buses en un bus de 4 bits

source: Bus4-Join-half: Join the two buses into a 4-bits Bus
es_es: Bus4-join-half: Unir dos buses en un bus de 4 bits

source: Bus5-Join-1-4: Join the two buses of 1 and 4 bits into a 5-bits Bus
es_es: Bus5-join-1-4: Unir dos buses de 1 y 4 bits en un bus de 5 bits

source: Bus5-Join-2-3: Join the two buses of 2 and 3 bits into a 5-bits Bus
es_es: Bus5-join-2-3: Unir dos buses de 2 y 3 bits en un bus de 5 bits

source: Bus5-Join-3-2: Join the two buses of 3 and 2 bits into a 5-bits Bus
es_es: Bus5-join-3-2: Unir dos buses de 3 y 2 bits en un bus de 5 bits

source: Bus5-Join-4-1: Join the two buses of 4 and 1 bits into a 5-bits Bus
es_es: Bus5-join-4-1: Unir dos buses de 4 y 1 bits en un bus de 5 bits

source: Bus6-Join-1-5: Join the two buses into a 6-bits Bus
es_es: Bus6-join-1-5: Unir dos buses en un bus de 6 bits

source: Bus6-Join-2-4: Join all the two buses into a 6-bits Bus
es_es: Bus6-join-2-4: Unir dos buses en un bus de 6 bits

source: Bus6-Join-4-2: Join the two buses into a 6-bits Bus
es_es: Bus6-join-4-2: Unir dos buses en un bus de 6 bits

source: Bus6-Join-5-1: Join the two buses into a 6-bits Bus
es_es: Bus6-join-5-1: Unir dos buses en un bus de 6 bits

source: Bus6-Join-half: Join the two buses into a 6-bits Bus
es_es: Bus6-Join-half: Unir dos buses en un bus de 6 bits

source: Bus7-Join-1-4: Join the two buses into a 7-bits Bus
es_es: Bus7-join-1-4: Unir dos buses en un bus de 7 bits

source: Bus7-Join-2-5: Join the two buses into a 7-bits Bus
es_es: Bus7-join-2-5: Unir dos buses en un bus de 7 bits

source: Bus7-Join-3-4: Join the two buses into a 7-bits Bus
es_es: Bus7-join-3-4: Unir dos buses en un bus de 7 bits

source: Bus7-Join-4-3: Join the two buses into a 7-bits Bus
es_es: Bus7-join-4-3: Unir dos buses en un bus de 7 bits

source: Bus7-Join-5-2: Join the two buses into a 7-bits Bus
es_es: Bus7-join-5-2: Unir dos buses en un bus de 7 bits

source: Bus7-Join-6-1: Join the two buses into a 7-bits Bus
es_es: Bus7-join-6-1: Unir dos buses en un bus de 7 bits

source: Bus7-Join-1-7: Join the two buses into an 8-bits Bus
es_es: Bus7-join-1-7: Unir dos buses en un bus de 8 bits

source: Bus8-Join-2-6: Join the two buses into an 8-bits Bus
es_es: Bus8-join-2-6: Unir dos buses en un bus de 8 bits

source: Bus8-Join-3-5: Join the two buses into an 8-bits Bus
es_es: Bus8-join-3-5: Unir dos buses en un bus de 8 bits

source: Bus8-Join-5-3: Join the two buses into an 8-bits Bus
es_es: Bus8-join-5-3: Unir dos buses en un bus de 8 bits

source: Bus8-Join-6-2: Join the two buses into an 8-bits Bus
es_es: Bus8-join-6-2: Unir dos buses en un bus de 8 bits

source: Bus7-Join-7-1: Join the two buses into an 8-bits Bus
es_es: Bus7-join-7-1: Unir dos buses en un bus de 8 bits

source: Bus8-Join-half: Join the two same halves into an 8-bits Bus
es_es: Bus8-join-half: Unir dos buses en un bus de 8 bits

source: Bus8-Join-quarter: Join the four quarters into an 8-bits Bus
es_es: Bus8-Join-quarter: Juntar los cuatro cuartos en bus de 8 bits

source: Bus8-Join-8-1: Join the two buses into an 9-bits Bus
es_es: Bus8-join-8-1: Unir dos buses en un bus de 9 bits

source: Bus10-Join-2-8: Join the two buses into an 10-bits Bus
es_es: Bus10-join-2-8: Unir dos buses en un bus de 10 bits

source: Bus11-Join-3-8: Join the two buses into an 11-bits Bus
es_es: Bus11-join-3-8: Unir dos buses en un bus de 11 bits

source: Bus12-Join-1-11: Join the two buses into an 12-bits Bus
es_es: Bus12-join-1-11: Unir dos buses en un bus de 12 bits

source: Bus12-Join-one-fourth: Join the four buses into an 12-bits Bus
es_es: Bus12-join-one-fourth: Unir los tres buses en un bus de 12 bits

source: Bus12-Join-one-third: Join the three buses into an 12-bits Bus
es_es: Bus12-join-one-third: Unir los tres buses en un bus de 12 bits

source: Bus15-Join-5-10: Join the two buses into a 15-bits Bus
es_es: Bus15-join-5-10: Unir dos buses en un bus de 15 bits

source: Bus15-Join-7-8: Join the two buses into a 15-bits Bus
es_es: Bus15-join-7-8: Unir dos buses en un bus de 15 bits

source: Bus16-Join-1-15: Join the two buses into a 16-bits Bus
es_es: Bus6-join-1-15: Unir dos buses en un bus de 16 bits

source: Bus16-Join-2-14: Join the two buses into a 16-bits Bus
es_es: Bus16-join-2-14: Unir dos buses en un bus de 16 bits

source: Bus16-Join-3-13: Join the two same halves into an 16-bits Bus
es_es: Bus16-Join-3-13: Unir los dos partes iguales en un bus de 16 bits

source: Bus16-Join-4-12: Join the two same halves into an 16-bits Bus
es_es: Bus16-Join-4-12: Unir los dos partes iguales en un bus de 16 bits

source: Bus16-Join-5-11: Join the two same halves into an 16-bits Bus
es_es: Bus16-Join-5-11: Unir los dos partes iguales en un bus de 16 bits

source: Bus16-Join-6-10: Join the two same halves into an 16-bits Bus
es_es: Bus16-Join-6-10: Unir los dos partes iguales en un bus de 16 bits

source: Bus16-Join-7-9: Join the two same halves into an 16-bits Bus
es_es: Bus16-Join-7-9: Unir los dos partes iguales en un bus de 16 bits

source: Bus16-Join-14-2: Join the two buses into a 16-bits Bus
es_es: Bus16-join-4-2: Unir dos buses en un bus de 16 bits

source: Bus16-Join-15-1: Join the two buses into a 16-bits Bus
es_es: Bus6-join-15-1: Unir dos buses en un bus de 16 bits

source: Bus16-Join-half: Join the two same halves into an 16-bits Bus
es_es: Bus16-join-half: Unir los dos partes iguales en un bus de 16 bits

source: Bus16-Join-quarter: Join the four same buses into an 16-bits Bus
es_es: Bus16-join-quarter: Unir cuatro buses iguales en un bus de 16 bits

source: Bus19-Join-3-8-8: Join the three buses into a 19-bits Bus
es_es: Bus19-join-3-8-8: Unir los tres buses en un bus de 19 bits

source: Bus20-Join-half: Join the two buses into an 20-bits Bus
es_es: Bus20-join-half: Unir dos buses en un bus de 20 bits

source: Bus20-Join-4-8-8: Join the three buses into an 20-bits Bus
es_es: Bus20-join-4-8-8: Unir los tres buses en un bus de 20 bits

source: Bus32-Join-11-21: Join the two buses into an 32-bits Bus
es_es: Bus32-join-11-21: Unir dos buses en un bus de 32 bits

source: Bus32-Join-10-22: Join the two buses into an 32-bits Bus
es_es: Bus32-join-10-22: Unir dos buses en un bus de 32 bits

source: Bus23-Join-7-8-8: Join the three buses into a 23-bits Bus
es_es: Bus23-join-7-8-8: Unir los tres buses en un bus de 23-bits

source: Bus24-Join-8-16: Join the two buses into an 24-bits Bus
es_es: Bus24-join-8-16: Unir dos buses en un bus de 24 bits

source: Bus24-Join-half: Join the two buses into an 24-bits Bus
es_es: Bus24-join-half: Unir dos buses en un bus de 24 bits

source: Bus24-Join-one-third: Join the three buses into an 24-bits Bus
es_es: Bus24-join-one-third: Unir tres buses en un bus de 24 bits

source: Bus27-Join-3-8-8-8: Join the four buses into a 27-bits Bus
es_es: Bus27-join-3-8-8-8: Unir cuatro buses en un bus de 27 bits

source: Bus28-Join-4-24: Join the two buses into an 28-bits Bus
es_es: Bus28-join-4-24: Unir dos buses en un bus de 28 bits

source: Bus28-Join-4-8-8-8: Join the four buses into an 28-bits Bus
es_es: Bus28-join-4-8-8-8: Unir cuatro buses en un bus de 28 bits

source: Bus31-Join-7-8-8-8: Join the four buses into a 31-bits Bus
es_es: Bus31-join-7-8-8-8: Unir cuatro buses en un bus de 31 bits

source: Bus32-Join-1-31: Join the two buses into an 32-bits Bus
es_es: Bus32-join-1-31: Unir dos buses en un bus de 32 bits

source: Bus32-Join-2-30: Join the two buses into an 32-bits Bus
es_es: Bus32-join-2-30: Unir dos buses en un bus de 32 bits

source: Bus32-Join-3-29: Join the two buses into an 32-bits Bus
es_es: Bus32-join-3-29: Unir dos buses en un bus de 32 bits

source: Bus32-Join-4-28: Join the two buses into an 32-bits Bus
es_es: Bus32-join-4-28: Unir dos buses en un bus de 32 bits

source: Bus32-Join-5-27: Join the two buses into an 32-bits Bus
es_es: Bus32-join-5-27: Unir dos buses en un bus de 32 bits

source: Bus32-Join-6-26: Join the two buses into an 32-bits Bus
es_es: Bus32-join-6-26: Unir dos buses en un bus de 32 bits

source: Bus32-Join-7-25: Join the two buses into an 32-bits Bus
es_es: Bus32-join-7-25: Unir dos buses en un bus de 32 bits

source: Bus32-Join-8-24: Join the two buses into an 32-bits Bus
es_es: Bus32-join-8-24: Unir dos buses en un bus de 32 bits

source: Bus32-Join-9-23: Join the two buses into an 32-bits Bus
es_es: Bus32-join-9-23: Unir dos buses en un bus de 32 bits

source: Bus32-Join-12-20: Join the two buses into an 32-bits Bus
es_es: Bus32-join-12-20: Unir dos buses en un bus de 32 bits

source: Bus32-Join-13-19: Join the two buses into an 32-bits Bus
es_es: Bus32-join-13-19: Unir dos buses en un bus de 32 bits

source: Bus32-Join-14-18: Join the two buses into an 32-bits Bus
es_es: Bus32-join-14-18: Unir dos buses en un bus de 32 bits

source: Bus32-Join-15-17: Join the two buses into an 32-bits Bus
es_es: Bus32-join-15-17: Unir dos buses en un bus de 32 bits

source: Bus32-Join-17-15: Join the two buses into an 32-bits Bus
es_es: Bus32-join-17-15: Unir dos buses en un bus de 32 bits

source: Bus32-Join-29-3: Join the two buses into an 32-bits Bus
es_es: Bus32-join-29-3: Unir dos buses en un bus de 32 bits

source: Bus32-Join-30-2: Join the two buses into an 32-bits Bus
es_es: Bus32-join-30-2: Unir dos buses en un bus de 32 bits

source: Bus32-Join-31-1: Join the two buses into an 32-bits Bus
es_es: Bus32-join-31-1: Unir dos buses en un bus de 32 bits

source: Bus32-Join-half: Join the two buses into an 32-bits Bus
es_es: Bus32-join-half: Unir dos buses en un bus de 32 bits

source: Bus32-Join-quarter: Join the four buses into an 32-bits Bus
es_es: Bus32-join-quarter: Unir cuatro buses en un bus de 32 bits

source: Bus64-Join-half: Join the two buses into an 64-bits Bus
es_es: Bus64-join-half: Unir dos buses en un bus de 64 bits

source: Reversal-2-verilog: 2-bit Bus reversal. Verilog implementation
es_es: Reversal-2-verilog: Inversión de un Bus de 2-bits. Implementación en Verilog

source: Reversal-3-verilog: 3-bit Bus reversal. Verilog implementation
es_es: Reversal-3-verilog: Inversión de un Bus de 2-bits. Implementación en Verilog

source: Reversal-4-verilog: 4-bit Bus reversal. Verilog implementation
es_es: Reversal-4-verilog: Inversión de un Bus de 4-bits. Implementación en Verilog

source: Reversal-5-verilog: 5-bit Bus reversal. Verilog implementation
es_es: Reversal-5-verilog: Inversión de un Bus de 5-bits. Implementación en Verilog

source: Reversal-2: 2-bit Bus reversal
es_es: Reversal-2: Inversión de un Bus de 2-bits

source: Bus2-Split-all: Split the 2-bits bus into two wires
es_es: Bus2-Split-all: Separar un bus de 2 bits en sus dos cables

source: Reversal-3: 3-bit Bus reversal
es_es: Reversal-3: Inversión de un Bus de 3-bits

source: Bus3-Split-all: Split the 3-bits bus into three wires
es_es: Bus3-Split-all: Separar un bus de 3 bits en sus tres cables

source: Reversal-4: 4-bit Bus reversal
es_es: Reversal-4: Inversión de un Bus de 4-bits

source: Bus4-Split-all: Split the 4-bits bus into its wires
es_es: Bus4-Split-all: Separar un bus de 4 bits en sus cables

source: Bus16-Split-half: Split the 16-bits bus into two buses of the same size
es_es: Bus16-Split-half: Separar un bus de 16 bits en dos buses del mismo tamaño

source: Bus32-Split-quarter: Split the 32-bits bus into four buses of 8 wires
es_es: Bus24-Split-quarter: Separar un bus de 32 bits en cuatro buses de 8 bits

source: SL1-2-verilog: Shift a 2-bit value one bit left. LSB is filled with
es_es: SL1-2-verilog: Desplazar un valor de 2 bits un bit a la izquierda. LSB se rellena con

source: SL1-int2: Shift a 2-bit value one bit left. LSB is 0. The sign is kept
es_es: SL1-int2: Desplazar un valor de 2 bits un bit a la izquierda. El LSB es 0. El signo se mantiene

source: Constant bit 0
es_es: Bit constante 0

source: SL1: Shift a 2-bit value one bit left. LSB is filled with
es_es: SL1: Desplaar un valor de 2 bits un bit a la izquierda. LSB se rellena con

source: Sign-int2: Get the sign of a 2-bits Intenger
es_es: Sign-int2: Obtener el signo de un entero de 2 bits

source: Sign bit is kept
es_es: El bit de signo se mantiene

source: Get the sign
es_es: Obtener el signo

source: SL1-uint2: Shift a 2-bit value one bit left. LSB is 0. The sign is lost
es_es: SL1-uint2: Desplazar un valor de 2 bits un bit a la izquierda. El LSB es 0. El signo se pierde

source: Sign bit is lost
es_es: El bit de signo se pierde

source: SL1-2: Shift a 2-bit value one bit left. LSB is filled with
es_es: SL1-2: Desplazar un valor de 2 bits un bit a la izquierda. LSB se rellena con

source: SL1-3-verilog: Shift a 3-bit value one bit left. LSB is filled with
es_es: SL1-3-verilog: Desplazar un valor de 3 bits un bit a la izquierda. LSB se rellena con

source: SL1-3: Shift a 3-bit value one bit left. LSB is filled with
es_es: SL1-3: Desplazar un valor de 3 bits un bit a la izquierda. LSB se rellena con

source: Bus3-Split-1-2: Split the 3-bits bus into two: 1-bit and 2-bits buses
es_es: Bus3-Split-1-2: Separar un bus de 3 bits en dos buses de 1 y 2 bits

source: SL1-4-verilog: Shift a 4-bit value one bit left. LSB is filled with
es_es: SL1-4-verilog: Desplazar un valor de 4 bits un bit a la izquierda. LSB se rellena con

source: SL1-4: Shift a 4-bit value one bit left. LSB is filled with
es_es: SL1-4: Desplazar un valor de 4 bits un bit a la izquierda. LSB se rellena con

source: Bus5-Split-1-4: Split the 5-bits bus into two buses of 1 and 4 bits
es_es: Bus5-Split-1-4: Separar un bus de 5 bits en dos buses de 1 y 4 bits

source: SL1-8-verilog: Shift a 8-bit value one bit left. LSB is filled with
es_es: SL1-1-8-verilog: Desplazar un valor de 8 bits un bit a la izquierda. LSB se rellena con

source: SL1-8: Shift a 8-bit value one bit left. LSB is filled with
es_es: SL1-8: Desplazar un valor de 8 bits un bit a la izquierda. LSB se rellena con

source: Bus9-Split-half: Split the 9-bits bus into two buses of 1 and 8 wires
es_es: Bus9-Split-half: Separar un bus de 9 bits en dos buses de 1 y 8 bits

source: SL1-16-verilog: Shift a 16-bit value one bit left. LSB is filled with
es_es: SL1-16-verilog: Desplazar un valor de 16 bits un bit a la izquierda. LSB se rellena con

source: SL1-16: Shift a 16-bit value one bit left. LSB is filled with
es_es: SL1-16: Desplazar un valor de 16 bits un bit a la izquierda. LSB se rellena con
