Repository: FPGAwars/iceWires
Catalog: locale/*/*.po
Languages: es_es

source: Bus16-Split-half: Split the 16-bits bus into two buses of 1 and 11 wires
es_es: Bus16-Split-half: Separar un bus de 16 bits en dos buses de 1 y 11 bits

source: SL1-32-verilog: Shift a 32-bit value one bit left. LSB is filled with
es_es: SL1-32-verilog: Desplazar un valor de 32 bits un bit a la izquierda. LSB se rellena con

source: Bus32-Split-1-31: Split the 32-bits bus into two buses of 1 and 31 wires
es_es: Bus32-Split-1-31: Separar un bus de 32 bits en dos buses de 1 y 31 cables

source: SR1-2bits-verilog: Shift a 2-bit value one bit right. MSB is filled with in. Verilog implementation
es_es: SR1-2bits-verilog: Desplazar un valor de 32-bits un bit a la derecha. MSB se rellena con la entrada in

source: SR1-int2: Shift a 2-bit value one bit right. MSB is keep (the sign)
es_es: SR1-int2: Desplazar un valor de 2 bits un bit a la derecha. MSB se mantiene (el signo)

source: SR1: Shift a 2-bit value one bit right. MSB is filled with
es_es: SR1: Desplazar un valor de 2-bits un bit a la derecha. MSB se rellena con

source: Get the sign and place it as the MSB
es_es: Obtener el signo y colocarlo como el bit MSB

source: SR1-uint2: Shift a 2-bit value one bit right. MSB is filled with 0 (no sign used)
es_es: SR1-uint2: Desplazar un valor de 2-bits un bit a la derecha. El MSB se rellena con 0 (no se usa signo)

source: The MSB is 0 (no sight)
es_es: El MSB es 0 (sin signo)

source: This bit is ignored
es_es: Este bit se ignora

source: Reg-2-verilog: 2 bits Register with load input. Verilog implementation
es_es: Reg-2-verilog: Registro de 2-bits con entrada de load. Implementación en Verilog

source: Button-tic: Configurable button that emits a tic when it is pressed
es_es: Button-tic: Botón configurable que emite un tic cuando se pulsa

source: Rising-edge detector. It generates a 1-period pulse (tic) when a rising edge is detected on the input
es_es: Detector de flanco de subida. Se genera un pulso de 1 ciclo cuando se detecta un flanco de subida en la entrada

source: D Flip-flop (verilog implementation)
es_es: Biestable D (Implementación en Verilog)

source: NOT gate (Verilog implementation)
es_es: Puerta NOT (Implementación en verilog)

source: Two bits input And gate
es_es: Puerta AND de dos entradas

source: Configurable button (pull-up on/off. Not on/off)
es_es: Botón configurable (pull-up on/off. Not on/off)

source: FPGA internal pull-up configuration on the input port
es_es: Configuración del pull-up interno de la FPGA en puerto de entrada

source: Remove the rebound on a mechanical switch
es_es: Eliminar los rebotes de un interruptor mecánico

source: 1bit register (implemented in verilog)
es_es: Registro de 1 bit (Implementado en verilog)

source: 16-bits Syscounter with reset
es_es: Contador del sistema de 16 bits con reset

source: DFF-rst-x16: 16 D flip-flops in paralell with reset
es_es: DFF-rst-x16: 16 Biestables D en paralelo con reset

source: DFF-rst-x04: Three D flip-flops in paralell with reset
es_es: DFF-rst-x04: Tres Biestables D en paralelo con reset

source: DFF-rst-x01: D Flip flop with reset input. When rst=1, the DFF is 0
es_es: DFF-rst-x01: Biestable D con entrada de reset. Cuando rst=1, el Biestable se pone a 0

source: Bus16-Split-quarter: Split the 16-bits bus into four buses of the same size
es_es: Bus16-Split-quarter: Separar un bus de 16 bits en cuatro buses del mismo tamaño

source: Inc1-16bit: Increment a 16-bits number by one
es_es: Inc1-16bit: Incrementar un número de 16 bits en uno

source: AdderK-16bit: Adder of 16-bit operand and 16-bit constant
es_es: AdderK-16bit: Sumador de un operando de 16 bits y una constante de 16 bits

source: Generic: 16-bits generic constant
es_es: Generic: Constante genérica de 16-bits

source: Adder-16bits: Adder of two operands of 16 bits
es_es: Adder-16bits: Sumador de dos operandos de 16 bits

source: Adder-8bits: Adder of two operands of 8 bits
es_es: Adder-8bits: Sumador de dos operandos de 8 bits

source: Bus8-Split-half: Split the 8-bits bus into two buses of the same size
es_es: Bus8-Split-half: Separar un bus de 8 bits en dos buses iguales

source: Adder-4bits: Adder of two operands of 4 bits
es_es: Adder-4bits: Sumador de dos operandos de 4 bits

source: Adder-1bit: Adder of two operands of 1 bit
es_es: Adder-1bit: Sumador de dos operandos de 1 bit

source: AdderC-1bit: Adder of two operands of 1 bit plus the carry in
es_es: AdderC-1bit: Sumador de dos operandos de 1 bit más el acarreo de entrada

source: XOR gate: two bits input xor gate
es_es: Puerta XOR: Puerta XOR de entrada de dos bits

source: OR2: Two bits input OR gate
es_es: OR2: Puerta OR de dos entradas

source: AdderC-4bits: Adder of two operands of 4 bits and Carry in
es_es: AdderC-4bits: Sumador de dos operandos de 4 bits más el acarreo de entrada

source: AdderC-8bits: Adder of two operands of 8 bits and Carry in
es_es: AdderC-8bit: Sumador de dos operandos de 8 bit más el acarreo de entrada

source: Edges detector. It generates a 1-period pulse (tic) when either a rising edge or a falling edge is detected on the input
es_es: Detector de flancos. Se genera un pulso de un ciclo cuando se detecta un flanco de subida o de bajada en la entrada

source: Sync 1-bit input with the system clock domain
es_es: Sincronizar una entrada de un bit con el dominio del reloj del sistema

source: Select positive or negative logic for the input (0=positive, 1=negative)
es_es: Seleccionar lógica positiva o negativa para la entrada (0=positiva, 1=negativa)

source: 1-bit generic constant (0/1)
es_es: Constante genérica de 1-bit (0/1)

source: # 2-bits Shift Right: Manual testing
es_es: # 2-bits Shift Right: Prueba manual

source: System clock
es_es: Reloj del sistema

source: Button state signal
es_es: Señal de estado del botón

source: Tic: button pressed
es_es: Tic: Botón apretado

source: Rising edge detector
es_es: Detector de flanco de subida

source: ## Rising edge detector It generates a 1-period pulse (tic) when a rising edge is detected on the input signal
es_es: ## Detector de flanco de subida Se genera un pulso de un ciclo cuando se detecta un flanco de subida en la señal de entrada

source: Input signal
es_es: Señal de entrada

source: Current signal state
es_es: Estado de la señal actual

source: Signal state in the previous clock cycle
es_es: Estado de la señal en el ciclo de reloj anterior

source: If the current signal is 1 and its value in the previous clock cycle was 0, it means that a rising edge has been detected! The output es 1 In any other case the output is 0
es_es: Si la señal actual es 1 y su valor en el ciclo previo era 0, significa que se ha detectado un flanco de subida! La salida es 1 En cualquier otro caso la salida es 0

source: **Delay**: 0 clock cycles There is no delay between the arrival of a rising edge and its detection
es_es: **Retraso**: 0 ciclos de reloj No hay retraso entre la llegada de un flanco de subida y su detección

source: Parameter: Initial value
es_es: Parámetro: Valor inicial

source: Input data
es_es: Datos de entrad

source: # D Flip-Flop It stores the input data that arrives at cycle n Its output is shown in the cycle n+1
es_es: # Biestable D El dato de entrada se almacena en el ciclo n Su salida se muestra en el ciclo n+1

source: Internal pull-up * 0: OFF * 1: ON
es_es: Pull-up interno * 0: OFF * 1: ON

source: Synchronization stage
es_es: Etapa de sincronización

source: Normalization stage * 0: Wire * 1: signal inverted
es_es: Etapa de normalización * 0: Cable * 1: Señal invertica

source: Debouncing stage
es_es: Etapa antirrebotes

source: ### Pull-up parameter: 0: No pull-up 1: Pull-up activated
es_es: ### Parámetro pull-up: 0: Sin pull-up 1: Pull-up activado

source: Only an FPGA pin can be connected here!!!
es_es: ¡¡Sólo se puede conectar aquí un pin de la FPGA!!

source: The pull-up is connected by default
es_es: El Pull-up se conecta por defecto

source: Edge detector
es_es: Detector de flancos

source: Whenever there is a change in the input, the counter is started
es_es: Siempre que haya un cambio en la entrada, se arranca el contador

source: If the counter reaches it maximum value, the input is considered stable and it is captured
es_es: Si el contador alcanza su máximo valor, la entrada se considera estable y se captura

source: ### Time calculation For CLK=12MHZ, a 16-bit counter reaches its maximum every 2 ** 16 * 1/F = 5.5ms aprox IF more time is needed for debouncing, use a counter with more bits (17, 18...)
es_es: ### Cálculo de tiempo Para CLK=12MHZ, un contador de 16 bits alcanza su valor máximo cada 2 ** 16 * 1/F = 5.5ms aprox Si se necesita más tiempo para el antirrebots, usa un contador con más bits (17, 18...)

source: ## Debouncer A value is considered stable when there is no changes during 5.5ms aprox. When a value is stable it is captured on the output flip-flop
es_es: ## Antirrebotes Un valor se considera estable cuando no hay cambios durante 5.5ms aprox Cuando un valor es estable se captura en el biestable

source: Stable output
es_es: Salida estable

source: Counter
es_es: Contador

source: Initial value
es_es: Valor inicial

source: Reset input: Active high When rst = 1, the DFF is reset to 0
es_es: Entrada de reset: Activa a nivel alto Cuando rst = 1, el biestable se inicializa a 0

source: Data input
es_es: Entrada de datos

source: Initial default value: 0
es_es: Valor inicial por defecto: 0

source: ## Edges detector It generates a 1-period pulse (tic) when an edge (Rising or falling) is detected on the input signal
es_es: ## Detector de flancos Se genera un pulso de un ciclo cuando un flanco (de subada o bajada) se detecta en la señal de entrada

source: The output is 1 if the current value is 1 and the previous 0, or if the current value is 0 and the previous 1
es_es: La salida es 1 si el valor actua es 1 y el previo 0, o si el valor actual es 0 y el previo 1

source: In any other case the output is 0
es_es: En cualquier otro caso la salida es 0

source: When k=0, it works like a wire (The output is equal to the input) When k=1, it act as a not gate (The output is the inverse of the input)
es_es: Cuando k=0, funciona como un cable (La salida es igual a la entrada) Cuando k=1, actúa como una puerta NOT (La salida es la inversa de la entrada)

source: ### Truth table for XOR | k | input | output | function | |---|-------|--------|----------| | 0 | 0 | 0 | wire | | 0 | 1 | 1 | wire | | 1 | 0 | 1 | Not | | 1 | 1 | 0 | Not |
es_es: ### Tabla de verdad para XOR | k | Entrada | Salida | Función | |---|-------|--------|----------| | 0 | 0 | 0 | cable | | 0 | 1 | 1 | cable | | 1 | 0 | 1 | Not | | 1 | 1 | 0 | Not |

source: SR1-3bits-verilog: Shift a 3-bit value one bit right. MSB is filled with in. Verilog implementation
es_es: SR1-3bits-verilog: Desplazar un valor de 3-bits un bit a la derecha. MSB se rellena con la entrada in. Implementación en Verilog

source: SR1-uint3: Shift a 3-bit value one bit right. MSB is filled with 0 (no sign used)
es_es: SR1-uint3: Desplazar un valor de 3 bits un bit a la derecha. El MSB se rellena con 0 (no se usa signo)

source: SR1: Shift a 3-bit value one bit right. MSB is filled with in
es_es: SR1: Desplazar un valor de 3-bits un bit a la derecha. MSB se rellena con in

source: Bus3-Split-2-1: Split the 3-bits bus into two: 2-bit and 1-bits buses
es_es: Bus3-Split-2-1: Separar un bus de 3 bits en dos buses de 2 y 1 bits

source: SR1-4bits-verilog: Shift a 4-bit value one bit right. MSB is filled with in. Verilog implementation
es_es: SR1-4bits-verilog: Desplazar un valor de 4-bits un bit a la derecha. MSB se rellena con la entrada in. Implementación en Verilog

source: SR1-uint4: Shift a 4-bit value one bit right. MSB is filled with 0 (no sign used)
es_es: SR1-uint4: Desplazar un valor de 4-bits un bit a la derecha. El MSB se rellena con 0 (no se usa signo)

source: SR1-4bits: Shift a 4-bit value one bit right. MSB is filled with in
es_es: SR1-4bits: Desplazar un valor de 4-bits un bit a la derecha. MSB se rellena con in

source: Bus4-Split-3-1: Split the 4-bits bus into two: 3-bits and 1-bits buses
es_es: Bus4-Split-3-1: Separar un bus de 4 bits en dos buses de 3 y 1 bits

source: SR1-8bits-verilog: Shift a 8-bit value one bit right. MSB is filled with in. Verilog implementation
es_es: SR1-8bits-verilog: Desplazar un valor de 8-bits un bit a la derecha. MSB se rellena con la entrada in. Implementación en Verilog

source: SR1-8bits: Shift a 8-bit value one bit right. MSB is filled with in
es_es: SR1-8bits: Desplazar un valor de 8-bits un bit a la derecha. MSB se rellena con in

source: Bus8-Split-7-1: Split the 8-bits bus into two buses of 7 and 1 wires
es_es: Bus8-Split-7-1: Separar un bus de 8 bits en dos buses de 7 y 1 bits

source: SR1-16bits-verilog: Shift a 16-bit value one bit right. MSB is filled with in. Verilog implementation
es_es: SR1-16bits-verilog: Desplazar un valor de 16-bits un bit a la derecha. MSB se rellena con la entrada in. Implementación en Verilog

source: SR1-16bits-verilog: Shift a 16-bit value one bit right. MSB is filled with in
es_es: SR1-16bits-verilog: Desplazar un valor de 16-bits un bit a la derecha. MSB se rellena con in

source: Bus16-Split-half: Split the 16-bits bus into two buses of 1 and 15 wires
es_es: Bus16-Split-half: Separar un bus de 16 bits en dos buses de 1 y 15 bits

source: SR1-32bits-verilog: Shift a 32-bit value one bit right. MSB is filled with in. Verilog implementation
es_es: SR1-32bits-verilog: Desplazar un valor de 32-bits un bit a la derecha. MSB se rellena con la entrada in. Implementación en Verilog

source: SR1-32bits-verilog: Shift a 32-bit value one bit right. MSB is filled with in
es_es: SR1-32bits-verilog: Desplazar un valor de 32-bits un bit a la derecha. MSB se rellena con in

source: Bus32-Split-31-1: Split the 32-bits bus into two buses of 31 and 1 wires
es_es: Bus32-Split-31-1: Separar un bus de 32 bits en dos buses de 31 y 1 cables

source: Sign-int12-verilog: Get the sign of a 12-bits Intenger. Verilog implementation
es_es: Sign-int12-verilog: Obtener el signo de un entero de 12 bits. Implementación en Verilog

source: Sign-int16-verilog: Get the sign of a 16-bits Intenger. Verilog implementation
es_es: Sign-int16-verilog: Obtener el signo de un entero de 16 bits. Implementación en Verilog

source: Sign-int2-verilog: Get the sign of a 2-bits Intenger. Verilog implementation
es_es: Sign-int2-verilog: Obtener el signo de un entero de 32 bits. Implementación en Verilog

source: Sign-int20-verilog: Get the sign of a 20-bits Intenger. Verilog implementation
es_es: Sign-int20-verilog: Obtener el signo de un entero de 20 bits. Implementación en Verilog

source: Sign-int3-verilog: Get the sign of a 3-bits Intenger. Verilog implementation
es_es: Sign-int3: Obtener el signo de un entero de 3 bits. Implementación en Verilog

source: Sign-int32-verilog: Get the sign of a 32-bits Intenger. Verilog implementation
es_es: Sign-int32-verilog: Obtener el signo de un entero de 32 bits. Implementación en Verilog

source: Sign-int4-verilog: Get the sign of a 4-bits Intenger. Verilog implementation
es_es: Sign-int4-verilog: Obtener el signo de un entero de 4 bits. Implementación en Verilog

source: Sign-int5-verilog: Get the sign of a 5-bits Intenger. Verilog implementation
es_es: Sign-int5-verilog: Obtener el signo de un entero de 5 bits. Implementación en Verilog

source: Sign-int6-verilog: Get the sign of a 6-bits Intenger. Verilog implementation
es_es: Sign-int6-verilog: Obtener el signo de un entero de 6 bits. Implementación en Verilog

source: Sign-int7-verilog: Get the sign of a 7-bits Intenger. Verilog implementation
es_es: Sign-int7-verilog: Obtener el signo de un entero de 7 bits. Implementación en Verilog

source: Sign-int8-verilog: Get the sign of a 8-bits Intenger. Verilog implementation
es_es: Sign-int8-verilog: Obtener el signo de un entero de 8 bits. Implementación en Verilog

source: Sign-int3: Get the sign of a 3-bits Intenger
es_es: Sign-int3: Obtener el signo de un entero de 3 bits

source: Sign-int4: Get the sign of a 4-bits Intenger
es_es: Sign-int4: Obtener el signo de un entero de 4 bits

source: Bus4-Split-1-3: Split the 4-bits bus into two: 1-bit and 3-bits buses
es_es: Bus4-Split-1-3: Separar un bus de 4 bits en dos buses de 1 y 3 bits

source: Sign-int5: Get the sign of a 5-bits Intenger
es_es: Sign-int5: Obtener el signo de un entero de 5 bits

source: Sign-int6: Get the sign of a 6-bits Intenger
es_es: Sign-int6: Obtener el signo de un entero de 6 bits

source: Bus6-Split-1-5: Split the 6-bits bus into two buses of 1 and 5 wires
es_es: Bus6-Split-1-5: Separar un bus de 6 bits en dos buses de 1 y 5 bits

source: Sign-int7: Get the sign of a 7-bits Intenger
es_es: Sign-int7: Obtener el signo de un entero de 7 bits

source: Bus7-Split-1-6: Split the 7-bits bus into two buses of 1 and 6 wires
es_es: Bus7-Split-1-6: Separar un bus de 7 bits en dos buses de 1 y 6 bits

source: Sign-int8: Get the sign of a 8-bits Intenger
es_es: Sign-int8: Obtener el signo de un entero de 8 bits

source: Bus8-Split-half: Split the 8-bits bus into two buses of 1 and 7 wires
es_es: Bus8-Split-half: Separar un bus de 8 bits en dos buses de 1 y 7 bits

source: Sign-int12: Get the sign of a 12-bits Intenger
es_es: Sign-int12: Obtener el signo de un entero de 12 bits

source: Bus12-Split-1-11: Split the 12-bits bus into two buses of 1 and 11 wires
es_es: Bus12-Split-1-11: Separar un bus de 12 bits en dos buses de 1 y 11 bits

source: Sign-int16: Get the sign of a 16-bits Intenger
es_es: Sign-int16: Obtener el signo de un entero de 16 bits

source: Sign-int20: Get the sign of a 20-bits Intenger
es_es: Sign-int20: Obtener el signo de un entero de 20 bits

source: Bus20-Split-1-19: Split the 20-bits bus into two buses of 1 and 19 wires
es_es: Bus20-Split-1-19: Separar un bus de 20 bits en dos buses de 1 y 19 bits

source: Sign-int32: Get the sign of a 32-bits Intenger
es_es: Sign-int32: Obtener el signo de un entero de 32 bits

source: Bus4-Split-half: Split the 4-bits bus into two of the same size
es_es: Bus4-Split-half: Separar un bus de 4 bits en dos buses del mismo tamaño

source: Bus5-Split-2-3: Split the 5-bits bus into two buses of 2 and 3 bits
es_es: Bus5-Split-2-3: Separar un bus de 5 bits en dos buses de 2 y 3 bits

source: Bus5-Split-3-2: Split the 5-bits bus into two buses of 3 and 2 bits
es_es: Bus5-Split-3-2: Separar un bus de 5 bits en dos buses de 3 y 2 bits

source: Bus5-Split-4-1: Split the 5-bits bus into two buses of 4 and 1 bits
es_es: Bus5-Split-4-1: Separar un bus de 5 bits en dos buses de 4 y 1 bits

source: Bus5-Split-all: Split the 5-bits bus into its wires
es_es: Bus5-Split-all: Separar un bus de 5 bits en sus cables

source: Bus6-Split-2-4: Split the 6-bits bus into two buses of 2 and 4 wires
es_es: Bus6-Split-2-4: Separar un bus de 6 bits en dos buses de 2 y 4 bits

source: Bus6-Split-4-2: Split the 6-bits bus into two buses of 4 and 2 wires
es_es: Bus6-Split-4-2: Separar un bus de 6 bits en dos buses de 4 y 2 bits

source: Bus6-Split-5-1: Split the 6-bits bus into two buses of 5 and 1 wires
es_es: Bus6-Split-5-1: Separar un bus de 6 bits en dos buses de 5 y 1 bits

source: Bus6-Split-all: Split the 6-bits bus into its wires
es_es: Bus6-Split-all: Separar un bus de 6 bits en sus cables

source: Bus6-Split-half: Split the 6-bits bus into two buses of 3 wires
es_es: Bus6-Split-half: Separar un bus de 6 bits en dos buses de 3 cables

source: Bus7-Split-2-5: Split the 7-bits bus into two buses of 2 and 5 wires
es_es: Bus7-Split-2-5: Separar un bus de 7 bits en dos buses de 2 y 5 bits

source: Bus7-Split-3-4: Split the 7-bits bus into two buses of 3 and 4 wires
es_es: Bus7-Split-3-4: Separar un bus de 7 bits en dos buses de 3 y 4 bits

source: Bus7-Split-4-3: Split the 7-bits bus into two buses of 4 and 3 wires
es_es: Bus7-Split-4-3: Separar un bus de 7 bits en dos buses de 4 y 3 bits

source: Bus7-Split-5-2: Split the 7-bits bus into two buses of 5 and 2 wires
es_es: Bus7-Split-5-2: Separar un bus de 7 bits en dos buses de 5 y 2 bits

source: Bus7-Split-6-1: Split the 7-bits bus into two buses of 6 and 1 wires
es_es: Bus7-Split-6-1: Separar un bus de 7 bits en dos buses de 6 y 1 bits

source: Bus7-Split-all: Split the 7-bits bus into its wires
es_es: Bus7-Split-all: Separar un bus de 7 bits en sus cables

source: Bus8-Split-3-5: Split the 8-bits bus into two buses of 3 and 5 wires
es_es: Bus8-Split-3-5: Separar un bus de 8 bits en dos buses de 3 y 5 bits

source: Bus8-Split-5-3: Split the 8-bits bus into two buses of 5 and 3 wires
es_es: Bus8-Split-5-3: Separar un bus de 8 bits en dos buses de 5 y 3 bits

source: Bus8-Split-6-2: Split the 8-bits bus into two buses of 6 and 2 wires
es_es: Bus8-Split-6-2: Separar un bus de 8 bits en dos buses de 6 y 2 bits

source: Bus8-Split-all: Split the 8-bits bus into its wires
es_es: Bus8-Split-all: Separar un bus de 8 bits en sus cables

source: Bus8-Split-quarter: Split the 8-bits bus into four buses of the same size
es_es: Bus8-Split-quarter: Separar un bus de 8 bits en cuatro buses del mismo tamaño

source: Bus10-Split-2-8: Split the 10-bits bus into two buses of 2 and 8 wires
es_es: Bus10-Split-2-8: Separar un bus de 10 bits en dos buses de 2 y 8 bits

source: Bus11-Split-3-8: Split the 11-bits bus into two buses of 3 and 8 wires
es_es: Bus11-Split-3-8: Separar un bus de 11 bits en dos buses de 3 y 8 bits

source: Bus12-Split-4-8: Split the 12-bits bus into two buses of 4 and 8 wires
es_es: Bus12-Split-4-8: Separar un bus de 12 bits en dos buses de 4 y 8 bits

source: Bus12-Split-one-third: Split the 12-bits bus into three buses of equal size
es_es: Bus12-Split-one-third: Separar un bus de 12 bits en tres buses del mismo tamaño

source: Bus15-Split-7-8: Split the 15-bits bus into two buses of 7 and 8 bits
es_es: Bus15-Split-7-8: Separar un bus de 15 bits en sus dos buses de 7 y 8 bits

source: Bus20-Split-4-16: Split the 20-bits bus into two buses of 4 and 16 wires
es_es: Bus20-Split-4-16: Separar un bus de 20 bits en dos buses de 4 y 16 bits

source: Bus19-Split-3-8-8: Split the 19-bits bus into three buses of 3, 8 and 8 wires
es_es: Bus19-Split-3-8-8: Separar un bus de 19 bits en dos buses de 3, 8 y 8 cables

source: Bus20-Split-8-12: Split the 20-bits bus into two buses of 8 and 12 wires
es_es: Bus20-Split-8-12: Separar un bus de 20 bits en dos buses de 8 y 12 bits

source: Bus20-Split-4-8-8: Split the 20-bits bus into three buses of 4, 8 and 8 wires
es_es: Bus20-Split-4-8-8: Separar un bus de 20 bits en tres de 4, 8 y 8 cables

source: Bus22-Split-16-6: Split the 22-bits bus into two buses of 16 and 6 wires
es_es: Bus22-Split-16-6: Separar un bus de 22 bits en dos buses de 16 y 6 bits

source: Bus19-Split-3-8-8: Split the 19-bits bus into three buses of 3,8 and 8 bits
es_es: Bus19-Split-3-8-8: Separar un bus de 19 bits en dos buses de 3, 8 y 8 bits

source: Bus24-Split-16-8: Split the 24-bits bus into two buses of 16 and 8 wires
es_es: Bus24-Split-16-8: Separar un bus de 24 bits en dos buses de 16 y 8 bits

source: Bus24-Split-8-16: Split the 24-bits bus into two buses of 8 and 16 wires
es_es: Bus24-Split-8-16: Separar un bus de 24 bits en dos buses de 8 y 16 bits

source: Bus24-Split-one-third: Split the 24-bits bus into three buses of the same size
es_es: Bus24-Split-one-third: Separar un bus de 24 bits en tres buses del mismo tamaño

source: Bus27-Split-3-8-8-8: Split the 27-bits bus into four buses of 7,8, 8 and 8 bits
es_es: Bus27-Split-3-8-8-8: Separar un bus de 27 bits en dos buses de 7,8,8 y 8 bits

source: Bus28-Split-20-8: Split the 28-bits bus into two buses of 20 and 8 wires
es_es: Bus28-Split-20-8: Separar un bus de 28 bits en dos buses de 20 y 8 bits

source: Bus28-Split-4-24: Split the 28-bits bus into two buses of 4 and 24 wires
es_es: Bus28-Split-4-24: Separar un bus de 28 bits en dos buses de 4 y 24 bits
