Repository: FPGAwars/iceWires
Catalog: locale/*/*.po
Languages: es_es

source: 2-to-1 Multplexer (32-bit channels). Verilog implementation
es_es: Multiplexor 2-1 (Canales de 32 bit). Implementación en verilog

source: # 32-bits sign Test: Displaying the sign bit on a LED The Sign of a number is shown on an LED
es_es: # Prueba de Sign-32bits: Mostrando el bit de signo en un LED El signo de un número se muestra en un LED

source: # Bus2-Split-all: Manual testing with two pushbuttons and an two LEDs The buttons SW1 and SW2 are connected to the LEDs 0 and 1 respectivelly When the buttons are pressed, the corresponding LED is turn on
es_es: # Bus2-Split-all: Prueba manual con dos pulsadores y dos LEDs Los botones SW1 y SW2 se conectan a los LEDs 0 y 1 respectivamente Cuando los botones se aprieta, el LED correspondiente se enciende

source: # Bus3-Split-1-2: Manual testing with a constant and LEDs The value of the constant is shown on the LEDs
es_es: # Bus3-Split-1-2: Prueba manual con una constante y LEDs El valor de la constante se muestra en los LEDs

source: # Bus3-Split-2-1: Manual testing with a constant and LEDs The value of the constant is shown on the LEDs
es_es: # Bus3-Split-2-1: Prueba manual con una constante y LEDs El valor de la constante se muestra en los LEDs

source: # Bus3-Split-all: Manual testing with a constant and LEDs The value of the constant is shown on the LEDs
es_es: # Bus3-Split-all: Prueba manual con una constante y LEDs El valor de la constante se muestra en los LEDs

source: # Bus4-Split-1-3: Manual testing with a constant and LEDs The value of the constant is shown on the LEDs
es_es: # Bus4-Split-1-3: Prueba manual con una constante y LEDs El valor de la constante se muestra en los LEDs

source: # Bus4-Split-3-1: Manual testing The value of the constant is shown on the LEDs
es_es: # Bus4-Split-3-1: Prueba manual El valor de la constante se muestra en los LEDs

source: # Bus4-Split-all: Manual testing with a constant and LEDs The value of the constant is shown on the LEDs
es_es: # Bus4-Split-all: Prueba manual con una constante y LEDs El valor de la constante se muestra en los LEDs

source: # Bus4-Split-half: Manual testing The value of the constant is shown on the LEDs
es_es: # Bus4-Split-half: Prueba manual El valor de la constante se muestra en los LEDs

source: # Bus5-Split-1-4: Manual testing with a constant and LEDs The value of the constant is shown on the LEDs
es_es: # Bus5-Split-1-4: Prueba manual con una constante y LEDs El valor de la constante se muestra en los LEDs

source: # Bus5-Split-2-3: Manual testing The value of the constant is shown on the LEDs
es_es: # Bus5-Split-2-3: Prueba manual El valor de la constante se muestra en los LEDs

source: # Bus5-Split-3-2: Manual testing The value of the constant is shown on the LEDs
es_es: # Bus5-Split-3-2: Prueba manual El valor de la constante se muestra en los LEDs

source: # Bus5-Split-4-1: Manual testing The value of the constant is shown on the LEDs
es_es: # Bus5-Split-4-1: Prueba manual El valor de la constante se muestra en los LEDs

source: # Bus5-Split-all: Manual testing with a constant and LEDs The value of the constant is shown on the LEDs
es_es: # Bus5-Split-all: Prueba manual con una constante y LEDs El valor de la constante se muestra en los LEDs

source: # Bus6-Split-1-5: Manual testing with a constant and LEDs The value of the constant is shown on the LEDs
es_es: # Bus6-Split-1-5: Prueba manual con una constante y LEDs El valor de la constante se muestra en los LEDs

source: # Bus6-Split-2-4: Manual testing with a constant and LEDs The value of the constant is shown on the LEDs
es_es: # Bus6-Split-2-4: Prueba manual con una constante y LEDs El valor de la constante se muestra en los LEDs

source: # Bus6-Split-4-2: Manual testing
es_es: # Bus6-Join-4-2: Prueba manual

source: # Bus6-Split-5-1: Manual testing
es_es: # Bus6-Join-5-1: Prueba manual

source: # Bus6-Split-all: Manual testing with a constant and LEDs The value of the constant is shown on the LEDs
es_es: # Bus6-Split-all: Prueba manual con una constante y LEDs El valor de la constante se muestra en los LEDs

source: # Bus6-Split-half: Manual testing
es_es: # Bus6-Split-half: Prueba manual

source: # Bus7-Split-1-6: Manual testing with a constant and LEDs The value of the constant is shown on the LEDs
es_es: # Bus7-Split-1-6: Prueba manual con una constante y LEDs El valor de la constante se muestra en los LEDs

source: # Bus7-Split-2-5: Manual testing The value of the constant is shown on the LEDs
es_es: # Bus7-Split-2-5: Prueba manual con una constante y LEDs El valor de la constante se muestra en los LEDs

source: # Bus7-Split-3-4: Manual testing with a constant and LEDs The value of the constant is shown on the LEDs
es_es: # Bus7-Split-3-4: Prueba manual con una constante y LEDs El valor de la constante se muestra en los LEDs

source: # Bus7-Split-4-3: Manual testing with a constant and LEDs The value of the constant is shown on the LEDs
es_es: # Bus7-Split-4-3: Prueba manual con una constante y LEDs El valor de la constante se muestra en los LEDs

source: # Bus7-Split-5-2: Manual testing The value of the constant is shown on the LEDs
es_es: # Bus7-Split-5-2: Prueba manual con una constante y LEDs El valor de la constante se muestra en los LEDs

source: # Bus7-Split-all: Manual testing with a constant and LEDs The value of the constant is shown on the LEDs
es_es: # Bus7-Split-all: Prueba manual con una constante y LEDs El valor de la constante se muestra en los LEDs

source: # Bus8-Split-1-7: Manual testing with a constant and LEDs The value of the constant is shown on the LEDs
es_es: # Bus8-Split-1-7: Prueba manual con una constante y LEDs El valor de la constante se muestra en los LEDs

source: Bus8-Split-2-6: Split the 8-bits bus into two buses of 2 and 6 wires
es_es: Bus8-Split-2-6: Separar un bus de 8 bits en dos buses de 2 y 6 bits

source: # Bus8-Split-2-6: Manual testing The value of the constant is shown on the LEDs
es_es: # Bus3-Split-2-6: Prueba manual El valor de la constante se muestra en los LEDs

source: # Bus8-Split-3-5: Manual testing The value of the constant is shown on the LEDs
es_es: # Bus3-Split-3-5: Prueba manual El valor de la constante se muestra en los LEDs

source: # Bus8-Split-5-3: Manual testing The value of the constant is shown on the LEDs
es_es: # Bus8-Split-5-3: Prueba manual El valor de la constante se muestra en los LEDs

source: # Bus8-Split-6-2: Manual testing The value of the constant is shown on the LEDs
es_es: # Bus8-Split-6-2: Prueba manual El valor de la constante se muestra en los LEDs

source: # Bus8-Split-7-1: Manual testing with a constant and LEDs The value of the constant is shown on the LEDs
es_es: # Bus8-Split-7-1: Prueba manual con una constante y LEDs El valor de la constante se muestra en los LEDs

source: # Bus8-Split-all: Manual testing with a constant and LEDs The value of the constant is shown on the LEDs
es_es: # Bus8-Split-all: Prueba manual con una constante y LEDs El valor de la constante se muestra en los LEDs

source: # Bus8-Split-half: Manual testing with a constant and LEDs The value of the constant is shown on the LEDs
es_es: # Bus3-Split-half: Prueba manual con una constante y LEDs El valor de la constante se muestra en los LEDs

source: # Bus8-Split-quarter: Manual testing with a constant and LEDs The value of the constant is shown on the LEDs
es_es: # Bus8-Split-quarter: Prueba manual con una constante y LEDs El valor de la constante se muestra en los LEDs

source: ## Bus-09-bits Split-1-8: Manual testing
es_es: ## Bus-09-bits Split-1-8: Prueba manual

source: ## Bus-09-bits Join-8-1: Manual testing
es_es: ## Bus-09-bits Join-8-1: Prueba manual

source: # Bus10-Split-2-8: Manual testing
es_es: # Bus10-Split-2-8: Prueba manual

source: # Bus11-Split-3-8: Manual testing
es_es: # Bus11-Split-3-8: Prueba manual

source: # Bus12-Split-1-11: Manual testing with a constant and LEDs The value of the constant is shown on the LEDs
es_es: # Bus 12-Split-1-11: Prueba manual con una constante y LEDs El valor de la constante se muestra en los LEDs

source: # Bus12-Split-4-8: Manual testing with a constant and LEDs The value of the constant is shown on the LEDs
es_es: # Bus 12-Split-4-8: Prueba manual con una constante y LEDs El valor de la constante se muestra en los LEDs

source: # Bus12-Split-one-third: Manual testing with a constant and LEDs The value of the constant is shown on the LEDs
es_es: # Bus12-Split-one-third: Prueba manual con una constante y LEDs El valor de la constante se muestra en los LEDs

source: ## Bus-15: Split-5-10: Manual testing
es_es: ## Bus-15-bits Split-5-10: Prueba manual

source: ## Bus-15: Split-7-8: Manual testing
es_es: ## Bus-15-bits Split-7-8: Prueba manual

source: ## Bus-16: Split-1-11: Manual testing
es_es: ## Bus-16: Split-1-11: Prueba manual

source: ## Bus-16: Split-15-1: Manual testing
es_es: ## Bus-16-bits Split-15-1: Prueba manual

source: ## Bus-16: Split-half: Manual testing
es_es: ## Bus-16-bits Split-half: Prueba manual

source: ## Split16-quarter: Manual testing The value is shown in 8 LEDs. Initially only the less significant bits. When the button is pressed, the Upper bits are displayed
es_es: ## Split16-quarter: Prueba manual El valor se muestra en los 8 LEDs. Inicialmente solo los bits menos sigfnificativos. cuando se aprieta el botón se muestran los superiores

source: ## Bus17-Split-1-16: Manual testing The 17-bit constnat is shown on the LEDs
es_es: # Bus17-Split-1-16: Prueba manual La constante de 17-bits se muestra en los LEDs

source: ## Bus-19: Split-3-8-8: Manual testing
es_es: ## Bus-19-bits Split-3-8-8: Prueba manual

source: ## Bus20-Split-1-19: Manual testing The 20-bits constants is displayed on the 8 LEDs.
es_es: # Bus20-Split-1-19: Prueba manual La constante de 20-bits se muestra en los 8 LEDs

source: Values for testing: 0-FFFFF
es_es: Valores para probar: 0-FFFFF

source: ## Bus20-Split-12-8: Manual testing The 20-bits constants is displayed on the 8 LEDs. When the sw1 button is pressed the 4 Most significant bits are displayed. The button sw2 switches between the 8 less significant bits and the 8 bits in the middle
es_es: ## Bus 20 Split-12-8: Prueba manual La constante de 20-bits se muestra en los 8 LEDs. Cuando el botón sw1 se aprieta los 4 bits más significativos se muestran. El botón sw2 cambia entre los 8 bits menos significativos y los 8 bits de en medio

source: ## Bus20-Split-4-16: Manual testing The 20-bits constants is displayed on the 8 LEDs. When the sw1 button is pressed the 4 Most significant bits are displayed. The button sw2 switches between the 8 less significant bits and the 8 bits in the middle
es_es: ## Bus 20 Split-4-16: Prueba manual La constante de 20-bits se muestra en los 8 LEDs. Cuando el botón sw1 se aprieta los 4 bits más significativos se muestran. El botón sw2 cambia entre los 8 bits menos significativos y los 8 bits de en medio

source: ## Bus20-Split-4-8-8: Manual testing The 20-bits constants is displayed on the 8 LEDs
es_es: # Bus20-Split-4-8-8: Prueba manual El valor de la constante se muestra en los LEDs

source: ## BUS22-split-16-6: Manual testing The 22-bits constants is displayed on the 8 LEDs
es_es: # Bus22-Split-16-6: Prueba manual La constante de 22-bits se muestra en los 8 LEDs

source: ## BUS24-split-16-8: Manual testing The 24-bits constants is displayed on the 8 LEDs. When the sw1 button is pressed the 8 Most significant bits are displayed. The button sw2 switches between the 8 less significant bits and the 8 bits in the middle
es_es: ## Bus 24 Split-16-8: Prueba manual La constante de 24-bits se muestra en los 8 LEDs. Cuando el botón sw1 se aprieta los 8 bits más significativos se muestran. El botón sw2 cambia entre los 8 bits menos significativos y los 8 bits de en medio

source: Values for testing: 0-FFFFFF
es_es: Valores para probar: 0-FFFFFF

source: ## BUS24-split-8-16: Manual testing The 24-bits constants is displayed on the 8 LEDs. When the sw1 button is pressed the 8 Most significant bits are displayed. The button sw2 switches between the 8 less significant bits and the 8 bits in the middle
es_es: ## Bus 24 Split-8-16: Prueba manual La constante de 24-bits se muestra en los 8 LEDs. Cuando el botón sw1 se aprieta los 8 bits más significativos se muestran. El botón sw2 cambia entre los 8 bits menos significativos y los 8 bits de en medio

source: ## Bus 24 Split one third: Manual testing The 24-bits constant is displayed on the 8 LEDs. The sw1 is used for displaying the lower, middle and higer segments of the constant on the LEDs
es_es: ## Bus 24 Split-one-third: Prueba manual La constante de 24-bits se muestra en los 8 LEDs. El boton sw1 se use para mostrar el byte inferior, de enmedio y superior de la constante en los LEDs

source: Generic: 27-bits generic constant
es_es: Generic: Constante genérica de 17-bits

source: ## Bus-27-Split-3-8-8-8: Manual testing
es_es: ## Bus-27-bits Split-3-8-8-8: Prueba manual

source: Generic: 28-bits generic constant
es_es: Generic: Constante genérica de 28-bits

source: ## Bus 28 Split-20-8: Manual testing The 28-bits constants is displayed on the 8 LEDs. When the sw1 button is pressed the 8 Most significant bits are displayed. The button sw2 switches between the 8 less significant bits and the 8 bits in the middle
es_es: ## Bus 28 Split-20-8: Prueba manual La constante de 28-bits se muestra en los 8 LEDs. Cuando el botón sw1 se aprieta los 8 bits más significativos se muestran. El botón sw2 cambia entre los 8 bits menos significativos y los 8 bits de en medio

source: ## Bus 28 Split-4-24: Manual testing The 28-bits constants is displayed on the 8 LEDs. When the sw1 button is pressed the 8 Most significant bits are displayed. The button sw2 switches between the 8 less significant bits and the 8 bits in the middle
es_es: ## Bus 28 Split-4-24: Prueba manual La constante de 28-bits se muestra en los 8 LEDs. Cuando el botón sw1 se aprieta los 8 bits más significativos se muestran. El botón sw2 cambia entre los 8 bits menos significativos y los 8 bits de en medio

source: Values for testing: 0-FFFFFFF
es_es: Valores para probar: 0-FFFFFFF

source: ## Bus-31: Split-7-8-8-8: Manual testing
es_es: ## Bus-31-bits Split-7-8-8-8: Prueba manual

source: ## 32-bits Split 1-31: Manual testing The 32-bits constants is displayed on the 8 LEDs. When the sw1 button is pressed the 8 Most significant bits are displayed. The button sw2 switches between the 8 less significant bits and the 8 bits in the middle
es_es: ## 32-bits Split 1-31: Prueba manual La constante de 32-bits se muestra en los 8 LEDs. Cuando el botón SW1 se aprieta los 8 bits más significativos se muestran. El botón SW2 cambia entre los 8 bits menos significativos y los 8 del medio

source: ## 32-bits Split 17-15: Manual testing The 32-bits constants is displayed on the 8 LEDs
es_es: # 32-bits Split 17-15: Prueba manual La constante de 32-bits se muestra en los 8 LEDs

source: ## 32-bits Split 22-10: Manual testing The 32-bits constants is displayed on the 8 LEDs
es_es: # 32-bits Split 22-10: Prueba manual La constante de 32-bits se muestra en los 8 LEDs

source: ## 32-bits Split 24-8: Manual testing The 32-bits constants is displayed on the 8 LEDs. When the sw1 button is pressed the 8 Most significant bits are displayed. The button sw2 switches between the 8 less significant bits and the 8 bits in the middle
es_es: ## 32-bits Split 24-8: Prueba manual La constante de 32-bits se muestra en los 8 LEDs. Cuando el botón SW1 se aprieta los 8 mibts más significativos se muestran. El botón SW2 cambia entre los 8 bits menos significativos y los 8 del medio

source: Values for testing: 0-FFFFFFFF
es_es: Valores para probar: 0-FFFFFFFF

source: ## 32-bits Split 29-3: Manual testing The 32-bits constant is shown on the LEDs
es_es: # 32-bits Split 29-3: Prueba manual La constante de 32-bits El valor de la constante se muestra en los LEDs

source: ## 32-bits Split 31-1: Manual testing The 32-bits constant is shown on the LEDs
es_es: # 32-bits Split 31-1: Prueba manual La constante de 32-bits se muestra en los LEDs

source: ## 32-bits Split 8-24: Manual testing The 32-bits constants is displayed on the 8 LEDs. When the sw1 button is pressed the 8 Most significant bits are displayed. The button sw2 switches between the 8 less significant bits and the 8 bits in the middle
es_es: ## 32-bits Split 8-24: Prueba manual La constante de 32-bits se muestra en los 8 LEDs. Cuando el botón SW1 se aprieta los 8 mibts más significativos se muestran. El botón SW2 cambia entre los 8 bits menos significativos y los 8 del medio

source: ## 32-bits Split half: Manual testing The 32-bits constants is displayed on the 8 LEDs
es_es: # Bus32-Split-half: Prueba manual El valor de la constante se muestra en los LEDs

source: ## 32-bits Split quarter: Manual testing The 32-bits constants is displayed on the 8 LEDs
es_es: # Bus32-Split-quarter: Prueba manual El valor de la constante se muestra en los LEDs

source: 8-to-1 Multplexer (8-bit channels)
es_es: Multiplexor 8-1 (Canales de 8 bits)

source: 8-to-1 Multplexer (2-bit channels)
es_es: Multiplexor 8-1 (Canales de 2 bits)

source: 8-to-1 Multplexer (1-bit channels)
es_es: Multiplexor 8-1 (Canales de 1 bit)

source: 4-to-1 Multplexer (1-bit channels)
es_es: Multiplexor 4-1 (Canales de 1 bit)

source: Counter-x03: 3-bits counter
es_es: Counter-x03: Contador de 3-bits

source: Reg-x03: 3-bits register
es_es: Reg-x03: Registro de 3 bits

source: Inc1-3bit: Increment a 3-bits number by one
es_es: Inc1-3bit: Incrementar un número de 3 bits en uno

source: AdderK-3bit: Adder of 3-bit operand and 3-bit constant
es_es: AdderK-3bit: Sumador de un operando de 3 bits y una constante de 3 bits

source: Adder-3bits: Adder of two operands of 3 bits
es_es: Adder-3bits: Sumador de dos operandos de 3 bits

source: Generic: 64-bits generic constant
es_es: Genérica: Constante genérica de 64 bits

source: ## 64-bits Split half: Manual testing The 64-bits constants is displayed on the 8 LEDs
es_es: # 64-bits Split-half: Prueba manual El valor de la constante se muestra en los LEDs

source: not-x2: 2-bits not gate
es_es: not-x2: Puerta not de 2 bits

source: not-x8: 8-bits not gate
es_es: not-x8: PUerta NOT de 8-bits

source: not-x4: 4-bits not gate
es_es: not-x4: PUerta NOT de 4-bits

source: ## Uint12-8bit Manual testing
es_es: ## Uint12-8bits: Prueba manual

source: ## Uint16-8bit Manual testing
es_es: ## Uint16-8bits: Prueba manual

source: ## Uint16-10bit Manual testing
es_es: ## Uint16-10bits: Prueba manual

source: ## Uint16-11bit Manual testing
es_es: ## Uint16-11bits: Prueba manual

source: ## Uint16-12bit Manual testing
es_es: ## Uint16-12bits: Prueba manual

source: ## Uint16-13bit Manual testing
es_es: ## Uint16-13bits: Prueba manual

source: ## Uint16-14bit Manual testing
es_es: ## Uint16-14bits: Prueba manual

source: UINT32-15bit-verilog: Extend a 15-bit unsigned integer to 32-bits. Verilog implementation
es_es: UINT32-15bit-verilog: Extender un entero sin signo de 15 bits a 32 bits. Implementación en Verilog

source: Copy-15: Copy the input wire twice and generate a 15 bits Bus output (Verilog implementation)
es_es: Copy-15: Copiar el cable de entrada dos veces y generar una salida de bus de 15 bits (Implementación en Verilog)

source: ## Uint32-15bit Manual testing
es_es: ## Uint32-15bits: Prueba manual

source: not-x32: 32-bits not gate
es_es: not-x32: Puerta NOT de 32 bits

source: ## Uint32-2bit Manual testing
es_es: ## Uint32-2bits: Prueba manual

source: ## Uint32-8bit Manual testing
es_es: ## Uint32-8bits: Prueba manual

source: ## Uint32-16bit Manual testing
es_es: ## Uint32-16bits: Prueba manual

source: ## Uint32-17bit Manual testing
es_es: ## Uint32-17bits: Prueba manual

source: ## Uint32-18bit Manual testing
es_es: ## Uint32-18bits: Prueba manual

source: ## Uint32-19bit Manual testing
es_es: ## Uint32-19bits: Prueba manual

source: ## Uint32-20bit Manual testing
es_es: ## Uint32-20bits: Prueba manual

source: ## Uint32-21bit Manual testing
es_es: ## Uint32-21bits: Prueba manual

source: ## Uint32-22bit Manual testing
es_es: ## Uint32-22bits: Prueba manual

source: ## Uint32-23bit Manual testing
es_es: ## Uint32-23bits: Prueba manual

source: ## Uint32-24bit Manual testing
es_es: ## Uint32-24bits: Prueba manual

source: ## Uint32-25bit Manual testing
es_es: ## Uint32-25bits: Prueba manual

source: ## Uint32-26bit Manual testing
es_es: ## Uint32-26bits: Prueba manual

source: ## Uint32-27bit Manual testing
es_es: ## Uint32-27bits: Prueba manual

source: ## Uint32-28bit Manual testing
es_es: ## Uint32-28bits: Prueba manual

source: ## Uint32-29bit: Manual testing
es_es: ## Uint32-29bits: Prueba manual

source: ## Uint32-30bit: Manual testing
es_es: ## Uint32-30bits: Prueba manual

source: ## Uint32-31bit: Manual testing
es_es: ## Uint32-31bits: Prueba manual

source: ## Uint4-1bit: Manual testing
es_es: ## Uint4-1bit: Prueba manual

source: ## Uint4-2bit: Manual testing
es_es: ## Uint4-2bit: Prueba manual

source: ## Uint4-3bit: Manual testing
es_es: ## Uint4-3bit: Prueba manual

source: # BUS-2: Manual testing with two pushbuttons and two LEDs The SW1 and SW2 buttons are connected to the LEDs 0 and 1 respectivelly When the buttons are is pressed the corresponding LED is turned on
es_es: # Bus2: Prueba manual con dos pulsadores y dos LEDs Los botones SW1 y SW2 se conectan a los LEDs 0 y 1 respectivamente Cuando los botones se aprieta, el LED correspondiente se enciende

source: # BUS-3: Manual testing with LEDs Turn on all the LEDs
es_es: # Bus3: Prueba manual con LEDs Encender todos los LEDs

source: # BUS-4: Manual testing with LEDs Turn on all the LEDs
es_es: # Bus-4: Prueba manual con LEDs Encender todos los LEDs

source: # BUS-5: Manual testing with LEDs Turn on all the LEDs
es_es: # Bus-5: Prueba manual con LEDs Encender todos los LEDs

source: # BUS-6: Manual testing with LEDs Turn on all the LEDs
es_es: # Bus-6: Prueba manual con LEDs Encender todos los LEDs

source: # BUS-7: Manual testing with LEDs Turn on all the LEDs
es_es: # Bus-7: Prueba manual con LEDs Encender todos los LEDs

source: # BUS-8: Manual testing with LEDs Turn on all the LEDs
es_es: # Bus-8: Prueba manual con LEDs Encender todos los LEDs

source: # Wire: Manual testing with one pushbutton and one LED When the button is pressed the LED0 is turned on
es_es: # Wire: Prueba manual con un botón y un LED Cuando el botón se aprieta el LED0 se enciende
