Repository: FPGAwars/iceWires
Catalog: locale/*/*.po
Languages: es_es

source: # Copy-8: Manual testing with one pushbutton and LEDs When the button is pressed, the LEDs are turned on
es_es: # Copy-8: Prueba manual con un botón y LEDs Cuando el botón se aprieta se encienden los LEDs

source: Display16-8: Display a 16-bits value on an 8-LEDs. The sel input selects the byte to display
es_es: Display16-8: Mostrar un valor de 16 bits en los 8 LEDs. La entrada sel selecciona el byte a mostrar

source: System TFF with toggle input: It toogles on every system cycle if the input is active
es_es: Biestable T del sistema con entrada de cambio: Cambia en cada ciclo del sistema si la entrada está activa

source: Reg: 1-Bit register
es_es: Reg: Registro de 1-Bit

source: 2-to-1 Multplexer (1-bit channels). Fippled version
es_es: Multiplexor 2-1 (Canales de 1 bit). Versión invertida

source: 2-to-1 Multplexer (1-bit channels)
es_es: Multiplexor 2-1 (Canales de 1 bit)

source: 2-to-1 Multplexer (8-bit channels)
es_es: Multiplexor 2-1 (Canales de 8 bits)

source: 2-to-1 Multplexer (4-bit channels)
es_es: Multiplexor 2-1 (Canales de 4 bits)

source: # Copy-9: Manual testing with one pushbutton and LEDs When the button is pressed, the LEDs are turned on
es_es: # Copy-9: Prueba manual con un botón y LEDs Cuando el botón se aprieta se encienden los LEDs

source: Byte 0 (least significant)
es_es: Byte 0 (Menos significativo)

source: D Flip-flip (System)
es_es: Biestable D (Sistema)

source: Channel B
es_es: Canal B

source: Channel A
es_es: Canal A

source: # Copy-10: Manual testing with one pushbutton and LEDs When the button is pressed, the LEDs are turned on
es_es: # Copy-10: Prueba manual con un botón y LEDs Cuando el botón se aprieta se encienden los dos LEDs

source: # Copy-11: Manual testing with one pushbutton and LEDs When the button is pressed, the LEDs are turned on
es_es: # Copy-11: Prueba manual con un botón y LEDs Cuando el botón se aprieta se encienden los dos LEDs

source: # Copy-12: Manual testing with one pushbutton and LEDs When the button is pressed, the LEDs are turned on
es_es: # Copy-12: Prueba manual con un botón y LEDs Cuando el botón se aprieta se encienden los dos LEDs

source: # Copy-16: Manual testing with one pushbutton and LEDs When the button is pressed, the LEDs are turned on
es_es: # Copy-16: Prueba manual con un botón y LEDs Cuando el botón se aprieta se encienden los LEDs

source: Display32-8: Display a 32-bits value on an 8-LEDs. The sel input selects the byte to display
es_es: Display32-8: Mostrar un valor de 32 bits en 8 LEDs. La entrada sel selecciona el byte a mostrar

source: 4-to-1 Multplexer (8-bit channels)
es_es: Multiplexor 4-1 (Canales de 8 bits)

source: Counter-x02: 2-bits counter
es_es: Counter-x02: Contador de 2 bits

source: Generic component with clk input
es_es: Componente genérico con entrada clk

source: Inc1-2bit: Increment a 2-bits number by one
es_es: Inc1-2bit: Incrementar un número de 2 bits en uno

source: AdderK-2bit: Adder of 2-bit operand and 2-bit constant
es_es: AdderK-2bit: Sumador de un operando de 2 bits y una constante de 2 bits

source: Adder-2bits: Adder of two operands of 2 bits
es_es: Adder-2bits: Sumador de dos operandos de 2 bits

source: OR-BUS2: OR gate with 2-bits bus input
es_es: OR-BUS2: Puerta OR de 2 bits de entrada

source: # Copy-20: Manual testing with one pushbutton and LEDs When the button is pressed, the LEDs are turned on
es_es: # Copy-20: Prueba manual con un botón y LEDs Cuando el botón se aprieta se encienden los dos LEDs

source: # Copy-24: Manual testing with one pushbutton and LEDs When the button is pressed, the LEDs are turned on
es_es: # Copy-24: Prueba manual con un botón y LEDs Cuando el botón se aprieta se encienden los LEDs

source: # Copy-28: Manual testing with one pushbutton and LEDs When the button is pressed, the LEDs are turned on
es_es: # Copy-28: Prueba manual con un botón y LEDs Cuando el botón se aprieta se encienden los LEDs

source: # Copy-32: Manual testing with one pushbutton and LEDs When the button is pressed, the LEDs are turned on
es_es: # Copy-32: Prueba manual con un botón y LEDs Cuando el botón se aprieta se encienden los dos LEDs

source: # Bus2-Join-all: Manual testing with two pushbuttons and an two LEDs The buttons SW1 and SW2 are connected to the LEDs 0 and 1 respectivelly When the buttons are pressed, the corresponding LED is turn on
es_es: # Bus2-Join-all: Prueba manual con dos pulsadores y dos LEDs Los botones SW1 y SW2 se conectan a los LEDs 0 y 1 respectivamente Cuando los botones se aprietan, el LED correspondiente se enciende

source: Constant bit 1
es_es: Bit constante 1

source: # Bus3-Join-1-2: Manual testing
es_es: # Bus3-Join-1-2: Prueba manual

source: # Bus3-Join-2-1: Manual testing
es_es: # Bus3-Join-2-1: Prueba manual

source: # Bus3-Join-all: Manual testing with two pushbuttons and two LEDs The buttons SW1 and SW2 are connected to the LEDs 0 and 1 respectivelly When the buttons are pressed, the corresponding LED is turned on The LED2 is on
es_es: # Bus3-Join-all: Prueba manual con dos pulsadores y dos LEDs Los botones SW1 y SW2 se conectan a los LEDs 0 y 1 respectivamente Cuando los botones se aprietan, el LED correspondiente se enciende El LED2 se enciende

source: 2bits constant value: 3
es_es: Valor constante 3 de 2 bits

source: # Bus4-Join-1-3: Manual testing
es_es: # Bus4-Join-1-3: Prueba manual

source: # Bus4-Join-3-1: Manual testing
es_es: # Bus4-Join-3-1: Prueba manual

source: # Bus4-Join-all: Manual testing with two pushbuttons and two LEDs The buttons SW1 and SW2 are connected to the LEDs 0 and 1 respectivelly When the buttons are pressed, the corresponding LED is turned on The LED2 and LED3 are on
es_es: # Bus4-Join-all: Prueba manual con dos pulsadores y dos LEDs Los botones SW1 y SW2 se conectan a los LEDs 0 y 1 respectivamente Cuando los botones se aprietan, el LED correspondiente se enciende Los LEDs 2 y 3 se encienden

source: # Bus4-Join-half: Manual testing
es_es: # Bus4-Join-half: Prueba manual

source: # Bus5-Join-1-4: Manual testing with two pushbuttons and two LEDs The buttons SW1 and SW2 are connected to the LEDs 4 and 0 respectivelly When the buttons are pressed, the corresponding LED is turned on The LED2 and LED3 are on
es_es: # Bus5-Join-1-4: Prueba manual con dos pulsadores y dos LEDs Los botones SW1 y SW2 se conectan a los LEDs 4 y 0 respectivamente Cuando los botones se aprietan, el LED correspondiente se enciende Los LEDs 2 y 3 se encienden

source: # Bus5-Join-2-3: Manual testing
es_es: # Bus5-Join-2-3: Prueba manual

source: # Bus5-Join-3-2: Manual testing
es_es: # Bus5-Join-3-2: Prueba manual

source: 3bits constant value: 7
es_es: Valor constante 7 de 3 bits

source: # Bus5-Join-4-1: Manual testing
es_es: # Bus5-Join-4-1: Prueba manual

source: # Bus5-Join-all: Manual testing with two pushbuttons and two LEDs The buttons SW1 and SW2 are connected to the LEDs 0 and 1 respectivelly When the buttons are pressed, the corresponding LED is turned on The LED2 and LED3 are on
es_es: # Bus5-Join-all: Prueba manual con dos pulsadores y dos LEDs Los botones SW1 y SW2 se conectan a los LEDs 0 y 1 respectivamente Cuando los botones se aprietan, el LED correspondiente se enciende Los LEDs 2 y 3 se encienden

source: # Bus6-Join-1-5: Manual testing with two pushbuttons and two LEDs The buttons SW1 and SW2 are connected to the LEDs 5 and 0 respectivelly When the buttons are pressed, the corresponding LED is turned on The LED2 and LED3 are on
es_es: # Bus6-Join-1-5: Prueba manual con dos pulsadores y dos LEDs Los botones SW1 y SW2 se conectan a los LEDs 5 y 0 respectivamente Cuando los botones se aprietan, el LED correspondiente se enciende Los LEDs 2 y 3 se encienden

source: # Bus6-Join-4-2: Manual testing
es_es: # Bus6-Join-4-2: Prueba manual

source: 4bits constant value: 15 (0xF in hexadecimal)
es_es: Valor constante 15 (0xF en hexadecimal) de 4 bits

source: # Bus6-Join-5-1: Manual testing
es_es: # Bus6-Join-5-1: Prueba manual

source: # Bus6-Join-half: Manual testing
es_es: # Bus6-Join-half: Prueba manual

source: Alhambr-II
es_es: Alhambra-II

source: # Bus7-Join-1-6: Manual testing with two pushbuttons and two LEDs The buttons SW1 and SW2 are connected to the LEDs 0 and 6 respectivelly When the buttons are pressed, the corresponding LED is turned on The LEDs 2-5 are on
es_es: # Bus7-Join-1-6: Prueba manual con dos pulsadores y dos LEDs Los botones SW1 y SW2 se conectan a los LEDs 0 y 6 respectivamente Cuando los botones se aprietan, el LED correspondiente se enciende Los LEDs 2-5 se encienden

source: # Bus7-Join-2-5: Manual testing
es_es: # Bus7-Join-2-5: Prueba manual

source: # Bus7-Join-3-4: Manual testing with two pushbuttons and two LEDs The buttons SW1 and SW2 are connected to the LEDs 0 and 6 respectivelly When the buttons are pressed, the corresponding LED is turned on The LEDs 2-5 are on
es_es: # Bus7-Join-3-4: Prueba manual con dos pulsadores y dos LEDs Los botones SW1 y SW2 se conectan a los LEDs 0 y 6 respectivamente Cuando los botones se aprietan, el LED correspondiente se enciende Los LEDs 2-5 se encienden

source: # Bus7-Join-4-3: Manual testing with two pushbuttons and two LEDs The buttons SW1 and SW2 are connected to the LEDs 0 and 6 respectivelly When the buttons are pressed, the corresponding LED is turned on The LEDs 2-5 are on
es_es: # Bus7-Join-4-3: Prueba manual con dos pulsadores y dos LEDs Los botones SW1 y SW2 se conectan a los LEDs 0 y 6 respectivamente Cuando los botones se aprietan, el LED correspondiente se enciende Los LEDs 2-5 se encienden

source: # Bus7-Join-5-2: Manual testing
es_es: # Bus7-Join-5-2: Prueba manual

source: # Bus7-Join-6-1: Manual testing
es_es: # Bus7-Join-6-1: Prueba manual

source: # Bus7-Join-all: Manual testing with two pushbuttons and two LEDs The buttons SW1 and SW2 are connected to the LEDs 0 and 1 respectivelly When the buttons are pressed, the corresponding LED is turned on The LEDs 2-6 are on
es_es: # Bus7-Join-all: Prueba manual con dos pulsadores y dos LEDs Los botones SW1 y SW2 se conectan a los LEDs 0 y 1 respectivamente Cuando los botones se aprietan, el LED correspondiente se enciende Los LEDs 2-6 se encienden

source: # Bus8-Join-1-7: Manual testing with two pushbuttons and two LEDs The buttons SW1 and SW2 are connected to the LEDs 0 and 7 respectivelly When the buttons are pressed, the corresponding LED is turned on The LEDs 1-6 are on
es_es: # Bus8-Join-1-7: Prueba manual con dos pulsadores y dos LEDs Los botones SW1 y SW2 se conectan a los LEDs 0 y 7 respectivamente Cuando los botones se aprietan, el LED correspondiente se enciende Los LEDs 1-6 se encienden

source: # Bus8-Join-2-6: Manual testing
es_es: # Bus8-Join-2-6: Prueba manual

source: # Bus8-Join-3-5: Manual testing with two pushbuttons and two LEDs The buttons SW1 and SW2 are connected to the LEDs 0 and 7 respectivelly When the buttons are pressed, the corresponding LED is turned on The LEDs 2-6 are on
es_es: # Bus8-Join-3-5: Prueba manual con dos pulsadores y dos LEDs Los botones SW1 y SW2 se conectan a los LEDs 0 y 7 respectivamente Cuando los botones se aprietan, el LED correspondiente se enciende Los LEDs 2-6 se encienden

source: # Bus8-Join-5-3: Manual testing with two pushbuttons and two LEDs The buttons SW1 and SW2 are connected to the LEDs 0 and 7 respectivelly When the buttons are pressed, the corresponding LED is turned on The LEDs 2-6 are on
es_es: # Bus8-Join-5-3: Prueba manual con dos pulsadores y dos LEDs Los botones SW1 y SW2 se conectan a los LEDs 0 y 7 respectivamente Cuando los botones se aprietan, el LED correspondiente se enciende Los LEDs 2-6 se encienden

source: # Bus8-Join-7-1: Manual testing with two pushbuttons and two LEDs The buttons SW1 and SW2 are connected to the LEDs 0 and 7 respectivelly When the buttons are pressed, the corresponding LED is turned on The LEDs 1-6 are on
es_es: # Bus8-Join-1-7: Prueba manual con dos pulsadores y dos LEDs Los botones SW1 y SW2 se conectan a los LEDs 0 y 7 respectivamente Cuando los botones se aprietan, el LED correspondiente se enciende Los LEDs 1-6 se encienden

source: # Bus8-Join-all: Manual testing with two pushbuttons and two LEDs The buttons SW1 and SW2 are connected to the LEDs 0 and 1 respectivelly When the buttons are pressed, the corresponding LED is turned on The LEDs 2-7 are on
es_es: # Bus8-Join-all: Prueba manual con dos pulsadores y dos LEDs Los botones SW1 y SW2 se conectan a los LEDs 0 y 1 respectivamente Cuando los botones se aprietan, el LED correspondiente se enciende Los LEDs 2-7 se encienden

source: # Bus8-Join-half: Manual testing with two pushbuttons and two LEDs The buttons SW1 and SW2 are connected to the LEDs 0 and 7 respectivelly When the buttons are pressed, the corresponding LED is turned on The LEDs 2-6 are on
es_es: # Bus8-Join-half: Prueba manual con dos pulsadores y dos LEDs Los botones SW1 y SW2 se conectan a los LEDs 0 y 7 respectivamente Cuando los botones se aprietan, el LED correspondiente se enciende Los LEDs 2-6 se encienden

source: # Bus8-Join-quarter: Manual testing with two pushbuttons and two LEDs The buttons SW1 and SW2 are connected to the LEDs 0 and 7 respectivelly When the buttons are pressed, the corresponding LED is turned on The LEDs 2-6 are on
es_es: # Bus8-Join-quarter: Prueba manual con dos pulsadores y dos LEDs Los botones SW1 y SW2 se conectan a los LEDs 0 y 7 respectivamente Cuando los botones se aprietan, el LED correspondiente se enciende Los LEDs 2-6 se encienden

source: ## Bus-09-bits Join-1-8: Manual testing
es_es: ## Bus-09-bits Join-1-8: Prueba manual

source: # Bus10-Join-2-8: Manual testing
es_es: # Bus10-Join-2-8: Prueba manual

source: # Bus11-Join-3-8: Manual testing
es_es: # Bus11-Join-3-8: Prueba manual

source: # Bus12-Join-one-1-11: Manual testing
es_es: # Bus12-Join-1-11: Prueba manual

source: # Bus12-Join-4-8: Manual testing
es_es: # Bus12-Join-4-8: Prueba manual

source: Counter-x01: 1-bit counter
es_es: Counter-x01: Contador de 1 bit

source: # Bus12-Join-one-forth: Manual testing
es_es: # Bus12-Join-one-forth: Prueba manual

source: # Bus12-Join-one-third: Manual testing
es_es: # Bus12-Join-one-third: Prueba manual

source: # Bus15-Join-5-10: Manual testing
es_es: # Bus15-Join-5-10: Prueba manual

source: # Bus15-Join-7-8: Manual testing
es_es: # Bus15-Join-7-8: Prueba manual

source: # Bus16-Join-1-15: Manual testing
es_es: # Bus6-Join-1-15: Prueba manual

source: # Bus16-Join-15-1: Manual testing
es_es: # Bus6-Join-15-1: Prueba manual

source: # Bus16-Join-4-12: Manual testing
es_es: # Bus16-Join-4-12: Prueba manual

source: # Bus16-Join-7-9: Manual testing
es_es: # Bus16-Join-7-9: Prueba manual

source: # Bus16-Join-half: Manual testing
es_es: # Bus16-Join-half: Prueba manual

source: # Bus16-Join-quarter: Manual testing
es_es: # Bus16-Join-quarter: Prueba manual

source: # Bus19-Join-3-8-8: Manual testing
es_es: # Bus19-Join-3-8-8: Prueba manual

source: Generic: 19-bits generic constant
es_es: Generic: Constante genérica de 19-bits

source: # Bus20-Join-1-19: Manual testing
es_es: # Bus20-Join-1-19: Prueba manual

source: # Bus20-Join-4-16: Manual testing
es_es: # Bus20-Join-4-16: Prueba manual

source: # Bus20-Join-4-8-8: Manual testing
es_es: # Bus20-Join-4-8-8: Prueba manual

source: Generic: 22-bits generic constant
es_es: Generic: Constante genérica de 22-bits

source: # Bus22-Join-10-22: Manual testing
es_es: # Bus22-Join-10-22: Prueba manual

source: # Bus23-Join-7-8-8: Manual testing
es_es: # Bus23-Join-7-8-8: Prueba manual

source: # Bus24-Join-8-16: Manual testing
es_es: # Bus24-Join-8-16: Prueba manual

source: Display24-8: Display a 24-bits value on 8-LEDs. The sel input selects the byte to display
es_es: Display24-8: Mostrar un valor de 24 bits en 8 LEDs. La entrada sel selecciona el byte a mostrar

source: Counter-M-x02: 2-bits M module counter
es_es: Counter-M-x02: Contador módulo M de 2 bits

source: Comp2-2bit: Comparator of two 2-bit numbers
es_es: Comp2-2-bit: Comparador de dos números de 2 bits

source: Comp2-1bit: Comparator of two 1-bit numbers
es_es: Comp2-1-bit: Comparador de dos números de 1 bit

source: reg-rst-2-bits: 2-bits register with reset
es_es: reg-rst-2-bits: Registro de 2 bits con reset

source: 1-bit-Reg-rst: 1-Bit register with reset
es_es: 1-bit-Reg-rst: Registro de 1-bit con reset

source: # Bus24-Join-half: Manual testing
es_es: # Bus24-Join-half: Prueba manual

source: 2-bits Comparator
es_es: Comparador de 2-bits

source: Maximum count reached
es_es: Cuenta máxima alcanzada

source: 2-bits register
es_es: Registro de 2 bits

source: If the max count is reached and the cnt tic is received, the register is reset to 0
es_es: Si se alcanza la cuenta máxima y se recibe un tic en cnt, el registro se inicializa a 0

source: # Bus24-Join-one-third: Manual testing
es_es: # Bus24-Join-one-third: Prueba manual

source: # Bus27-Join-3-8-8-8: Manual testing
es_es: # Bus27-Join-3-8-8-8: Prueba manual

source: Generic: 24-bits generic constant
es_es: Generic: Constante genérica de 24-bits

source: # Bus28-Join-4-24: Manual testing
es_es: # Bus28-Join-4-24: Prueba manual

source: # Bus28-Join-4-8-8-8: Manual testing
es_es: # Bus28-Join-4-8-8-8: Prueba manual

source: # Bus31-Join-7-8-8-8: Manual testing
es_es: # Bus31-Join-7-8-8-8: Prueba manual

source: Generic: 31-bits generic constant
es_es: Generic: Constante genérica de 31-bits

source: # Bus32-Join-31-1: Manual testing
es_es: # Bus32-Join-31-1: Prueba manual

source: Generic: 17-bits generic constant
es_es: Generic: Constante genérica de 17-bits

source: # Bus32-Join-17-15: Manual testing
es_es: # Bus32-Join-17-15: Prueba manual

source: Generic: 29-bits generic constant
es_es: Generic: Constante genérica de 29-bits

source: # Bus32-Join-29-3: Manual testing
es_es: # Bus32-Join-29-3: Prueba manual

source: 2bits constant value: 1
es_es: Valor constante de 2 bits: 1

source: # Bus32-Join-30-2: Manual testing
es_es: # Bus32-Join-30-2: Prueba manual

source: # Bus32-Join-8-24: Manual testing
es_es: # Bus32-Join-8-24: Prueba manual

source: # Bus32-Join-half: Manual testing
es_es: # Bus32-Join-half: Prueba manual

source: # Bus32-Join-quarter: Manual testing
es_es: # Bus32-Join-quarter: Prueba manual

source: ## Reversal test
es_es: ## Prueba de Inversión

source: Generic: 32-bits generic constant
es_es: Generic: Constante genérica de 32-bits

source: ## BUS-2-Shift-Left-1: Manual testing
es_es: # BUS-2-Shift-Left-1: Prueba manual

source: Reg-3-verilog: 3 bits Register with load input. Verilog implementation
es_es: Reg-3-verilog: Registro de 3 bits con entradas de load. Implementación en Verilog

source: ## BUS-3-Shift-Left-1: Manual testing
es_es: # BUS-3-Shift-Left-1: Prueba manual

source: Reg-4-verilog: 4 bits Register with load input. Verilog implementation
es_es: Reg-4-verilog: Registro de 4 bits con entradas de load. Implementación en Verilog

source: ## BUS-4-Shift-Left-1: Manual testing
es_es: # BUS-4-Shift-Left-1: Prueba manual

source: Reg-8-verilog: 8 bits Register with load input. Verilog implementation
es_es: Reg-8-verilog: Registro de 8 bits con entradas de load. Implementación en Verilog

source: ## BUS-8-Shift-Left-1: Manual testing
es_es: # BUS-8-Shift-Left-1: Prueba manual

source: Reg-16-verilog: 16 bits Register with load input. Verilog implementation
es_es: Reg-16-verilog: Registro de 16 bits con entradas de load. Implementación en Verilog

source: ## BUS-16-Shift-Left-1: Manual testing
es_es: # BUS-16-Shift-Left-1: Prueba manual

source: Reg-03-verilog: 32 bits Register with load input. Verilog implementation
es_es: Reg-03-verilog: Registro de 32 bits con entradas de load. Implementación en Verilog

source: SR1: Shift a 2-bit value one bit right. MSB is filled with in
es_es: SR1: Desplazar un valor de 2-bits un bit a la derecha. MSB se rellena con in

source: # 3-bits Shift Right: Manual testing
es_es: # 3-bits Shift Right: Prueba manual

source: # 4-bits Shift Right: Manual testing
es_es: # 4-bits Shift Right: Prueba manual

source: # 8-bits Shift Right: Manual testing
es_es: # 8-bits Shift Right: Prueba manual

source: # 16-bits Shift Right: Manual testing
es_es: # 16-bits Shift Right: Prueba manual

source: # 32-bits Shift Right: Manual testing
es_es: # 32-bits Shift Right: Prueba manual

source: 2-to-1 Multplexer (2-bit channels). Verilog implementation
es_es: Multiplexor 2-1 (Canales de 2 bits). Implementación en verilog

source: # 2-bits sign Test: Displaying the sign bit on a LED The Sign of a number is shown on an LED
es_es: # Prueba de Sign-2bits: Mostrando el bit de signo en un LED El signo de un número se muestra en un LED

source: 2-to-1 Multplexer (3-bit channels). Verilog implementation
es_es: Multiplexor 2-1 (Canales de 3 bit). Implementación en verilog

source: # 3-bits sign Test: Displaying the sign bit on a LED The Sign of a number is shown on an LED
es_es: # Prueba de Sign-3bits: Mostrando el bit de signo en un LED El signo de un número se muestra en un LED

source: 2-to-1 Multplexer (4-bit channels). Verilog implementation
es_es: Multiplexor 2-1 (Canales de 4 bit). Implementación en verilog

source: # 4-bits sign Test: Displaying the sign bit on a LED The Sign of a number is shown on an LED
es_es: # Prueba de Sign-4bits: Mostrando el bit de signo en un LED El signo de un número se muestra en un LED

source: 2-to-1 Multplexer (5-bit channels). Verilog implementation
es_es: Multiplexor 2-1 (Canales de 5 bit). Implementación en verilog

source: # 5-bits sign Test: Displaying the sign bit on a LED The Sign of a number is shown on an LED
es_es: # Prueba de Sign-5bits: Mostrando el bit de signo en un LED El signo de un número se muestra en un LED

source: 2-to-1 Multplexer (6-bit channels). Verilog implementation
es_es: Multiplexor 2-1 (Canales de 6 bit). Implementación en verilog

source: # 6-bits sign Test: Displaying the sign bit on a LED The Sign of a number is shown on an LED
es_es: # Prueba de Sign-6bits: Mostrando el bit de signo en un LED El signo de un número se muestra en un LED

source: 2-to-1 Multplexer (7-bit channels). Verilog implementation
es_es: Multiplexor 2-1 (Canales de 7 bit). Implementación en verilog

source: # 7-bits sign Test: Displaying the sign bit on a LED The Sign of a number is shown on an LED
es_es: # Prueba de Sign-7bits: Mostrando el bit de signo en un LED El signo de un número se muestra en un LED

source: 2-to-1 Multplexer (8-bit channels). Verilog implementation
es_es: Multiplexor 2-1 (Canales de 8 bit). Implementación en verilog

source: # 8-bits sign Test: Displaying the sign bit on a LED The Sign of a number is shown on an LED
es_es: # Prueba de Sign-8bits: Mostrando el bit de signo en un LED El signo de un número se muestra en un LED

source: 2-to-1 Multplexer (12-bit channels). Verilog implementation
es_es: Multiplexor 2-1 (Canales de 12 bit). Implementación en verilog

source: # 12-bits sign Test: Displaying the sign bit on a LED The Sign of a number is shown on an LED
es_es: # Prueba de Sign-12bits: Mostrando el bit de signo en un LED El signo de un número se muestra en un LED

source: 2-to-1 Multplexer (16-bit channels). Verilog implementation
es_es: Multiplexor 2-1 (Canales de 16 bit). Implementación en verilog

source: # 16-bits sign Test: Displaying the sign bit on a LED The Sign of a number is shown on an LED
es_es: # Prueba de Sign-16bits: Mostrando el bit de signo en un LED El signo de un número se muestra en un LED

source: 2-to-1 Multplexer (20-bit channels). Verilog implementation
es_es: Multiplexor 2-1 (Canales de 20 bit). Implementación en verilog

source: Generic: 20-bits generic constant
es_es: Generic: Constante genérica de 20-bits

source: # 20-bits sign Test: Displaying the sign bit on a LED The Sign of a number is shown on an LED
es_es: # Prueba de Sign-20bits: Mostrando el bit de signo en un LED El signo de un número se muestra en un LED
